MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_tim.h
  * @brief   Header file for the TIM HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_TIM_H
#define STM32C5XX_HAL_TIM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_tim.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (TIM1)  \
 || defined (TIM2)  \
 || defined (TIM3)  \
 || defined (TIM4)  \
 || defined (TIM5)  \
 || defined (TIM6)  \
 || defined (TIM7)  \
 || defined (TIM8)  \
 || defined (TIM12) \
 || defined (TIM15) \
 || defined (TIM16) \
 || defined (TIM17)

/** @defgroup TIM TIM
  * @{
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @addtogroup TIM_Private_Constants
  * @{
  */

/**
  * @brief Shift to apply to a value (period or pulse)
  *        to obtain the equivalent value when dithering is enabled.
  */
#define HAL_TIM_DITHERING_SHIFT  (4U)

/**
  * @brief Number of TIM channels.
  * @note  Number of fields in the @ref hal_tim_channel_t.
  */
#define HAL_TIM_CHANNELS  (11U)

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/*  */
/**
  * @brief Number of DMA requests.
  * @note  Number of fields in the @ref hal_tim_dma_index_t.
  */
#define HAL_TIM_DMA_REQUESTS  (7U)

/** @defgroup TIM_Substates Substate of an active state
  * @{
  */
/** Not silent substate */
#define HAL_TIM_ACTIVE_NOT_SILENT  (0U)
/** Silent substate */
#define HAL_TIM_ACTIVE_SILENT      (1U)
/**
  * @}
  */
#endif /* USE_HAL_TIM_DMA */

/**
  * @}
  */

/* Exported macros ---------------------------------------------------------------------------------------------------*/
/**
  * @brief Macro to compute a value with a dithered value.
  */
#define HAL_TIM_COMPUTE_DITHERED_VALUE(value, dithering_pattern) \
  (((value) << HAL_TIM_DITHERING_SHIFT) | (dithering_pattern))

/**
  * @brief Macro to compute the period with a dithered value.
  */
#define HAL_TIM_COMPUTE_DITHERED_PERIOD(period, period_dithering_pattern) \
  HAL_TIM_COMPUTE_DITHERED_VALUE(period, period_dithering_pattern)

/**
  * @brief Macro to compute the pulse with a dithered value.
  */
#define HAL_TIM_COMPUTE_DITHERED_PULSE(pulse, pulse_dithering_pattern) \
  HAL_TIM_COMPUTE_DITHERED_VALUE(pulse, pulse_dithering_pattern)

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_Exported_Constants HAL TIM Constants
  * @{
  */

#if defined (USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)
/** @defgroup  TIM_Error_Code Error Code definition reflecting asynchronous process errors
  * @{
  */
#define HAL_TIM_ERROR_NONE  (0U)    /*!< No error            */
#define HAL_TIM_ERROR_DMA   (1U)    /*!< DMA transfer error  */
/**
  * @}
  */
#endif /* USE_HAL_TIM_GET_LAST_ERRORS */


/** @defgroup TIM_Optional_Interruptions Optional interruptions
  * @note     To be used as parameters of functions @ref HAL_TIM_Start_IT_Opt(),
  *           @ref HAL_TIM_Start_DMA_Opt()
  * @{
  */
/**
  * @brief HAL TIM interrupts.
  *        The interrupts are grouped in the following categories:
  *        - Update:       Update interrupt
  *        - Commutation:  Commutation interrupt
  *        - Trigger:      Trigger interrupt
  *        - Break:        Break interrupt
  *        - Encoder:      Encoder interrupts
  * @note  These interrupts are used in @ref HAL_TIM_Start_IT_Opt().
  */
/** TIM optional update interrupt */
#define HAL_TIM_OPT_IT_UPDATE                    (LL_TIM_DIER_UIE)
/** TIM optional commutation interrupt */
#define HAL_TIM_OPT_IT_COMMUTATION               (LL_TIM_DIER_COMIE)
/** TIM optional trigger interrupt */
#define HAL_TIM_OPT_IT_TRIGGER_INPUT             (LL_TIM_DIER_TIE)
/** TIM optional break interrupt */
#define HAL_TIM_OPT_IT_BREAK                     (LL_TIM_DIER_BIE)
/** TIM optional encoder index interrupt */
#define HAL_TIM_OPT_IT_ENCODER_INDEX             (LL_TIM_DIER_IDXIE)
/** TIM optional encoder direction interrupt */
#define HAL_TIM_OPT_IT_ENCODER_DIRECTION         (LL_TIM_DIER_DIRIE)
/** TIM optional encoder index error interrupt */
#define HAL_TIM_OPT_IT_ENCODER_INDEX_ERROR       (LL_TIM_DIER_IERRIE)
/** TIM optional encoder transition error interrupt */
#define HAL_TIM_OPT_IT_ENCODER_TRANSITION_ERROR  (LL_TIM_DIER_TERRIE)

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief HAL TIM Filters for the DMA interrupts.
  *        By default the half transfer complete callbacks are disabled.
  * @note  These interrupts are used in @ref HAL_TIM_Start_DMA_Opt().
  */
/** Disable DMA half transfer complete callbacks */
#define HAL_TIM_OPT_DMA_IT_NONE       (HAL_DMA_OPT_IT_NONE)
/** Enable the half-transfer callbacks */
#define HAL_TIM_OPT_DMA_IT_HT         (HAL_DMA_OPT_IT_HT)
/** Enable the half-transfer and transfer complete callbacks */
#define HAL_TIM_OPT_DMA_IT_DEFAULT    (HAL_DMA_OPT_IT_DEFAULT)

/** All interrupts are filtered */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define HAL_TIM_OPT_DMA_IT_SILENT     (HAL_DMA_OPT_IT_SILENT)
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_TIM_DMA */
/**
  * @}
  */

/** @defgroup TIM_Group_Channel5 Group Channel 5
  * @note     To be used as parameters of function @ref HAL_TIM_OC_SetGroupChannel()
  * @{
  */
/**
  * @brief HAL TIM Group Channel 5.
  */
/** No effect of channel 5 on channels 1, 2 and 3 */
#define HAL_TIM_GROUP_NONE         (LL_TIM_GROUPCH5_NONE)

