MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
/** Group channel 5 and channel 1 (ANDed) */
#define HAL_TIM_GROUP_AND_OC1REFC  (LL_TIM_GROUPCH5_AND_OC1REFC)

/** Group channel 5 and channel 2 (ANDed) */
#define HAL_TIM_GROUP_AND_OC2REFC  (LL_TIM_GROUPCH5_AND_OC2REFC)

/** Group channel 5 and channel 3 (ANDed) */
#define HAL_TIM_GROUP_AND_OC3REFC  (LL_TIM_GROUPCH5_AND_OC3REFC)

/** Group channel 5 and channel 4 (ANDed) */
#define HAL_TIM_GROUP_AND_OC4REFC  (LL_TIM_GROUPCH5_AND_OC4REFC)

/** Group channel 5 and channel 1 (ORed) */
#define HAL_TIM_GROUP_OR_OC1REFC   (LL_TIM_GROUPCH5_OR_OC1REFC)

/** Group channel 5 and channel 2 (ORed) */
#define HAL_TIM_GROUP_OR_OC2REFC   (LL_TIM_GROUPCH5_OR_OC2REFC)

/** Group channel 5 and channel 3 (ORed) */
#define HAL_TIM_GROUP_OR_OC3REFC   (LL_TIM_GROUPCH5_OR_OC3REFC)

/** Group channel 5 and channel 4 (ORed) */
#define HAL_TIM_GROUP_OR_OC4REFC   (LL_TIM_GROUPCH5_OR_OC4REFC)
/**
  * @}
  */


/**
  * @defgroup TIM_Break_Input_Sources Break Input Sources
  * @{
  */
/**
  * @brief  HAL TIM Break Input Sources.
  * @note   The pattern of the defines is: HAL_TIM_BRK_TIMx_<source>
  */
/** TIM1 break input is connected to TIM1_BKIN */
#define HAL_TIM_BRK_TIM1_GPIO         (LL_TIM_TIM1_BRK_GPIO)
/** TIM1 break input is connected to comp1_out */
#define HAL_TIM_BRK_TIM1_COMP1_OUT    (LL_TIM_TIM1_BRK_COMP1_OUT)
#if defined(COMP2)
/** TIM1 break input is connected to comp2_out */
#define HAL_TIM_BRK_TIM1_COMP2_OUT    (LL_TIM_TIM1_BRK_COMP2_OUT)
#endif /* COMP2 */
/** TIM1 break input is connected to TIM8_BKIN */
#define HAL_TIM_BRK_TIM1_TIM8_BKIN    (LL_TIM_TIM1_BRK_TIM8_BKIN)
/** TIM1 break input is connected to TIM15_BKIN */
#define HAL_TIM_BRK_TIM1_TIM15_BKIN   (LL_TIM_TIM1_BRK_TIM15_BKIN)
#if defined(TIM16)
/** TIM1 break input is connected to TIM16_BKIN */
#define HAL_TIM_BRK_TIM1_TIM16_BKIN   (LL_TIM_TIM1_BRK_TIM16_BKIN)
/** TIM1 break input is connected to TIM17_BKIN */
#define HAL_TIM_BRK_TIM1_TIM17_BKIN   (LL_TIM_TIM1_BRK_TIM17_BKIN)
#endif /* TIM16 */


/** TIM8 break input is connected to TIM8_BKIN */
#define HAL_TIM_BRK_TIM8_GPIO         (LL_TIM_TIM8_BRK_GPIO)
/** TIM8 break input is connected to comp1_out */
#define HAL_TIM_BRK_TIM8_COMP1_OUT    (LL_TIM_TIM8_BRK_COMP1_OUT)
#if defined(COMP2)
/** TIM8 break input is connected to comp2_out */
#define HAL_TIM_BRK_TIM8_COMP2_OUT    (LL_TIM_TIM8_BRK_COMP2_OUT)
#endif /* COMP2 */
/** TIM8 break input is connected to TIM1_BKIN */
#define HAL_TIM_BRK_TIM8_TIM1_BKIN    (LL_TIM_TIM8_BRK_TIM1_BKIN)
/** TIM8 break input is connected to TIM15_BKIN */
#define HAL_TIM_BRK_TIM8_TIM15_BKIN   (LL_TIM_TIM8_BRK_TIM15_BKIN)
#if defined(TIM16)
/** TIM8 break input is connected to TIM16_BKIN */
#define HAL_TIM_BRK_TIM8_TIM16_BKIN   (LL_TIM_TIM8_BRK_TIM16_BKIN)
/** TIM8 break input is connected to TIM17_BKIN */
#define HAL_TIM_BRK_TIM8_TIM17_BKIN   (LL_TIM_TIM8_BRK_TIM17_BKIN)
#endif /* TIM16 */


/** TIM15 break input is connected to TIM15_BKIN */
#define HAL_TIM_BRK_TIM15_GPIO         (LL_TIM_TIM15_BRK_GPIO)
/** TIM15 break input is connected to comp1_out */
#define HAL_TIM_BRK_TIM15_COMP1_OUT    (LL_TIM_TIM15_BRK_COMP1_OUT)
#if defined(COMP2)
/** TIM15 break input is connected to comp2_out */
#define HAL_TIM_BRK_TIM15_COMP2_OUT    (LL_TIM_TIM15_BRK_COMP2_OUT)
#endif /* COMP2 */
/** TIM15 break input is connected to TIM1_BKIN */
#define HAL_TIM_BRK_TIM15_TIM1_BKIN    (LL_TIM_TIM15_BRK_TIM1_BKIN)
/** TIM15 break input is connected to TIM8_BKIN */
#define HAL_TIM_BRK_TIM15_TIM8_BKIN    (LL_TIM_TIM15_BRK_TIM8_BKIN)
#if defined(TIM16)
/** TIM15 break input is connected to TIM16_BKIN */
#define HAL_TIM_BRK_TIM15_TIM16_BKIN   (LL_TIM_TIM15_BRK_TIM16_BKIN)
/** TIM15 break input is connected to TIM17_BKIN */
#define HAL_TIM_BRK_TIM15_TIM17_BKIN   (LL_TIM_TIM15_BRK_TIM17_BKIN)
#endif /* TIM16 */


#if defined(TIM16)
/** TIM16 break input is connected to TIM16_BKIN */
#define HAL_TIM_BRK_TIM16_GPIO         (LL_TIM_TIM16_BRK_GPIO)
/** TIM16 break input is connected to comp1_out */
#define HAL_TIM_BRK_TIM16_COMP1_OUT    (LL_TIM_TIM16_BRK_COMP1_OUT)
/** TIM16 break input is connected to TIM1_BKIN */
#define HAL_TIM_BRK_TIM16_TIM1_BKIN    (LL_TIM_TIM16_BRK_TIM1_BKIN)
/** TIM16 break input is connected to TIM8_BKIN */
#define HAL_TIM_BRK_TIM16_TIM8_BKIN    (LL_TIM_TIM16_BRK_TIM8_BKIN)
/** TIM16 break input is connected to TIM15_BKIN */
#define HAL_TIM_BRK_TIM16_TIM15_BKIN   (LL_TIM_TIM16_BRK_TIM15_BKIN)
/** TIM16 break input is connected to TIM17_BKIN */
#define HAL_TIM_BRK_TIM16_TIM17_BKIN   (LL_TIM_TIM16_BRK_TIM17_BKIN)
#endif /* TIM16 */


#if defined(TIM17)
/** TIM17 break input is connected to TIM17_BKIN */
#define HAL_TIM_BRK_TIM17_GPIO         (LL_TIM_TIM17_BRK_GPIO)
/** TIM17 break input is connected to comp1_out */
#define HAL_TIM_BRK_TIM17_COMP1_OUT    (LL_TIM_TIM17_BRK_COMP1_OUT)
/** TIM17 break input is connected to TIM1_BKIN */
#define HAL_TIM_BRK_TIM17_TIM1_BKIN    (LL_TIM_TIM17_BRK_TIM1_BKIN)
/** TIM17 break input is connected to TIM8_BKIN */
#define HAL_TIM_BRK_TIM17_TIM8_BKIN    (LL_TIM_TIM17_BRK_TIM8_BKIN)
/** TIM17 break input is connected to TIM15_BKIN */
#define HAL_TIM_BRK_TIM17_TIM15_BKIN   (LL_TIM_TIM17_BRK_TIM15_BKIN)
/** TIM17 break input is connected to TIM16_BKIN */
#define HAL_TIM_BRK_TIM17_TIM16_BKIN   (LL_TIM_TIM17_BRK_TIM16_BKIN)
#endif /* TIM17 */

/**
  * @brief  HAL TIM Break2 Input Sources.
  * @note   The pattern of the defines is: HAL_TIM_BRK2_TIMx_<source>
  */
/** TIM1 break2 input is connected to TIM1_BKIN2 */
#define HAL_TIM_BRK2_TIM1_GPIO         (LL_TIM_TIM1_BRK2_GPIO)
/** TIM1 break2 input is connected to comp1_out */
#define HAL_TIM_BRK2_TIM1_COMP1_OUT    (LL_TIM_TIM1_BRK2_COMP1_OUT)
#if defined(COMP2)
/** TIM1 break2 input is connected to comp2_out */
#define HAL_TIM_BRK2_TIM1_COMP2_OUT    (LL_TIM_TIM1_BRK2_COMP2_OUT)
#endif /* COMP2 */
/** TIM1 break2 input is connected to TIM8_BKIN2 */
#define HAL_TIM_BRK2_TIM1_TIM8_BKIN2   (LL_TIM_TIM1_BRK2_TIM8_BKIN2)


/** TIM8 break2 input is connected to TIM8_BKIN2 */
#define HAL_TIM_BRK2_TIM8_GPIO         (LL_TIM_TIM8_BRK2_GPIO)
/** TIM8 break2 input is connected to comp1_out */
#define HAL_TIM_BRK2_TIM8_COMP1_OUT    (LL_TIM_TIM8_BRK2_COMP1_OUT)
#if defined(COMP2)
/** TIM8 break2 input is connected to comp2_out */
#define HAL_TIM_BRK2_TIM8_COMP2_OUT    (LL_TIM_TIM8_BRK2_COMP2_OUT)
#endif /* COMP2 */
/** TIM8 break2 input is connected to TIM1_BKIN2 */
#define HAL_TIM_BRK2_TIM8_TIM1_BKIN2   (LL_TIM_TIM8_BRK2_TIM1_BKIN2)

/**
  * @}
  */
/**
  * @}
  */

