MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_Exported_Types HAL TIM Types
  * @{
  */

/**
  * @brief HAL TIM instance.
  */
typedef enum
{
  HAL_TIM1  = TIM1_BASE,

  HAL_TIM2  = TIM2_BASE,

#if defined(TIM3)
  HAL_TIM3  = TIM3_BASE,
#endif /* TIM3 */

#if defined(TIM4)
  HAL_TIM4  = TIM4_BASE,
#endif /* TIM4 */

#if defined(TIM5)
  HAL_TIM5  = TIM5_BASE,
#endif /* TIM5 */

  HAL_TIM6  = TIM6_BASE,

  HAL_TIM7  = TIM7_BASE,

  HAL_TIM8  = TIM8_BASE,

  HAL_TIM12 = TIM12_BASE,

  HAL_TIM15 = TIM15_BASE,

#if defined(TIM16)
  HAL_TIM16 = TIM16_BASE,

  HAL_TIM17 = TIM17_BASE,
#endif /* TIM16 */


} hal_tim_t;


/**
  * @brief  HAL TIM Global States definition.
  */
typedef enum
{
  /** Peripheral not yet initialized                     */
  HAL_TIM_STATE_RESET   = 0U,

  /** Peripheral initialized but not yet configured      */
  HAL_TIM_STATE_INIT    = (1UL << 31U),

  /** Peripheral initialized and a global config applied */
  HAL_TIM_STATE_IDLE    = (1UL << 30U),

  /** Counter is running */
  HAL_TIM_STATE_ACTIVE  = (1UL << 29U),

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  HAL_TIM_STATE_ACTIVE_SILENT = (HAL_TIM_STATE_ACTIVE | HAL_TIM_ACTIVE_SILENT),
#endif /* USE_HAL_TIM_DMA */

} hal_tim_state_t;


/**
  * @brief  TIM Channel States definition.
  */
typedef enum
{
  /** TIM Channel initial state                                */
  HAL_TIM_CHANNEL_STATE_RESET       = (1UL << 31U),

  /** TIM Channel ready for use as output channel              */
  HAL_TIM_OC_CHANNEL_STATE_IDLE     = (1UL << 30U),

  /** An internal process is ongoing on the TIM output channel */
  HAL_TIM_OC_CHANNEL_STATE_ACTIVE   = (1UL << 29U),

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /** An internal process is ongoing on the TIM output channel in DMA silent mode */
  HAL_TIM_OC_CHANNEL_STATE_ACTIVE_SILENT   = (HAL_TIM_OC_CHANNEL_STATE_ACTIVE \
                                              | HAL_TIM_ACTIVE_SILENT),
#endif /* USE_HAL_TIM_DMA */

  /** TIM Channel ready for use as input channel               */
  HAL_TIM_IC_CHANNEL_STATE_IDLE     = (1UL << 28U),

  /** An internal process is ongoing on the TIM input channel */
  HAL_TIM_IC_CHANNEL_STATE_ACTIVE   = (1UL << 27U),

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)

  /** An internal process is ongoing on the TIM input channel in DMA silent mode */
  HAL_TIM_IC_CHANNEL_STATE_ACTIVE_SILENT   = (HAL_TIM_IC_CHANNEL_STATE_ACTIVE \
                                              | HAL_TIM_ACTIVE_SILENT),
#endif /* USE_HAL_TIM_DMA */

} hal_tim_channel_state_t;


/**
  * @brief  HAL TIM Channels identifier definition.
  */
typedef enum
{
  /** Timer input/output channel 1         */
  HAL_TIM_CHANNEL_1   = 0U,

  /** Timer input/output channel 2         */
  HAL_TIM_CHANNEL_2   = 1U,

  /** Timer input/output channel 3         */
  HAL_TIM_CHANNEL_3   = 2U,

  /** Timer input/output channel 4         */
  HAL_TIM_CHANNEL_4   = 3U,

  /** Timer output channel 5               */
  HAL_TIM_CHANNEL_5   = 4U,

  /** Timer output channel 6               */
  HAL_TIM_CHANNEL_6   = 5U,

  /** Timer output channel 7               */
  HAL_TIM_CHANNEL_7   = 6U,

  /** Timer complementary output channel 1 */
  HAL_TIM_CHANNEL_1N  = 7U,

  /** Timer complementary output channel 2 */
  HAL_TIM_CHANNEL_2N  = 8U,

  /** Timer complementary output channel 3 */
  HAL_TIM_CHANNEL_3N  = 9U,

  /** Timer complementary output channel 4 */
  HAL_TIM_CHANNEL_4N  = 10U,

} hal_tim_channel_t;


/**
  * @brief HAL TIM Counter Mode.
  */
typedef enum
{
  /** Counter used as up-counter                                     */
  HAL_TIM_COUNTER_UP   = LL_TIM_COUNTERMODE_UP,

  /** Counter used as down-counter                                   */
  HAL_TIM_COUNTER_DOWN = LL_TIM_COUNTERMODE_DOWN,

  /** Center-aligned mode 1                                          */
  HAL_TIM_COUNTER_CENTER_DOWN = LL_TIM_COUNTERMODE_CENTER_DOWN,

  /** Center-aligned mode 2                                          */
  HAL_TIM_COUNTER_CENTER_UP = LL_TIM_COUNTERMODE_CENTER_UP,

  /** Center-aligned mode 3                                          */
  HAL_TIM_COUNTER_CENTER_UP_DOWN = LL_TIM_COUNTERMODE_CENTER_UP_DOWN,

} hal_tim_counter_mode_t;


/**
  * @brief TIM DTS Clock Prescaler.
  */
typedef enum
{
  /** tDTS=tTIM_KER_CK                        */
  HAL_TIM_DTS_DIV1 = LL_TIM_CLOCKDIVISION_DIV1,

  /** tDTS=2*tTIM_KER_CK                      */
  HAL_TIM_DTS_DIV2 = LL_TIM_CLOCKDIVISION_DIV2,

  /** tDTS=4*tTIM_KER_CK                      */
  HAL_TIM_DTS_DIV4 = LL_TIM_CLOCKDIVISION_DIV4,

  /** tDTS=8*tTIM_KER_CK                      */
  HAL_TIM_DTS_DIV8 = LL_TIM_CLOCKDIVISION_DIV8,

} hal_tim_dts_prescaler_t;


/**
  * @brief TIM DTS2 Clock Prescaler.
  */
typedef enum
{
  /** tDTS2=tDTS                                          */
  HAL_TIM_DTS2_DIV1 = LL_TIM_CLOCKDIVISION2_DIV1,

  /** tDTS2=4*tDTS                                        */
  HAL_TIM_DTS2_DIV4 = LL_TIM_CLOCKDIVISION2_DIV4,

  /** tDTS2=16*tDTS                                       */
  HAL_TIM_DTS2_DIV16 = LL_TIM_CLOCKDIVISION2_DIV16,

  /** tDTS2=64*tDTS                                       */
  HAL_TIM_DTS2_DIV64 = LL_TIM_CLOCKDIVISION2_DIV64,

  /** tDTS2=256*tDTS                                      */
  HAL_TIM_DTS2_DIV256 = LL_TIM_CLOCKDIVISION2_DIV256,

  /** tDTS2=1024*tDTS                                     */
  HAL_TIM_DTS2_DIV1024 = LL_TIM_CLOCKDIVISION2_DIV1024,

  /** tDTS2=4096*tDTS                                     */
  HAL_TIM_DTS2_DIV4096 = LL_TIM_CLOCKDIVISION2_DIV4096,

  /** tDTS2=16384*tDTS                                    */
  HAL_TIM_DTS2_DIV16384 = LL_TIM_CLOCKDIVISION2_DIV16384,

  /** tDTS2=65536*tDTS                                    */
  HAL_TIM_DTS2_DIV65536 = LL_TIM_CLOCKDIVISION2_DIV65536,

  /** tDTS2=262144*tDTS                                   */
  HAL_TIM_DTS2_DIV262144 = LL_TIM_CLOCKDIVISION2_DIV262144,

} hal_tim_dts2_prescaler_t;


/**
  * @brief HAL TIM Clock Source definition.
  */
typedef enum
{
  /** Internal clock source (timer kernel clock)                                   */
  HAL_TIM_CLK_INTERNAL = LL_TIM_CLK_INTERNAL,

  /** External clock source mode 1                                                 */
  HAL_TIM_CLK_EXTERNAL_MODE1 = LL_TIM_CLK_EXTERNAL_MODE1,

  /** External clock source mode 2                                                 */
  HAL_TIM_CLK_EXTERNAL_MODE2 = LL_TIM_CLK_EXTERNAL_MODE2,

