MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** Quadrature encoder mode: x1 mode, counting on TI1FP1 edges only,
      edge sensitivity is set by CC1P                                              */
  HAL_TIM_CLK_ENCODER_X1_TI1 = LL_TIM_CLK_ENCODER_X1_TI1,

  /** Quadrature encoder mode: x1 mode, counting on TI2FP2 edges only,
      edge sensitivity is set by CC2P                                              */
  HAL_TIM_CLK_ENCODER_X1_TI2 = LL_TIM_CLK_ENCODER_X1_TI2,

  /** Quadrature encoder mode 1: x2 mode, counts up/down on TI1FP1
      edge depending on TI2FP2 level                                               */
  HAL_TIM_CLK_ENCODER_X2_TI1 = LL_TIM_CLK_ENCODER_X2_TI1,

  /** Quadrature encoder mode 2: x2 mode, counts up/down on TI2FP2
      edge depending on TI1FP1 level                                               */
  HAL_TIM_CLK_ENCODER_X2_TI2 = LL_TIM_CLK_ENCODER_X2_TI2,

  /** Quadrature encoder mode 3: x4 mode, counts up/down on both
      TI1FP1 and TI2FP2 edges depending on the level of the other input            */
  HAL_TIM_CLK_ENCODER_X4_TI12 = LL_TIM_CLK_ENCODER_X4_TI12,

  /** Quadrature encoder with built-in debouncer: x2 mode, counts up/down
      on TI1FP1 edge depending on TI2FP2 level                                     */
  HAL_TIM_CLK_ENCODER_DEBOUNCER_X2_TI1 = LL_TIM_CLK_ENCODER_DEBOUNCER_X2_TI1,

  /** Quadrature encoder with built-in debouncer: x4 mode, counts up/down on
      both TI1FP1 and TI2FP2 edges depending on the level of the other input       */
  HAL_TIM_CLK_ENCODER_DEBOUNCER_X4_TI12 = LL_TIM_CLK_ENCODER_DEBOUNCER_X4_TI12,

  /** Encoder mode: Clock plus direction, x2 mode                                  */
  HAL_TIM_CLK_ENCODER_CLK_PLUS_X2 = LL_TIM_CLK_ENCODER_CLK_PLUS_X2,

  /** Encoder mode: Clock plus direction, x1 mode,
      TI2FP2 edge sensitivity is set by CC2P                                       */
  HAL_TIM_CLK_ENCODER_CLK_PLUS_X1 = LL_TIM_CLK_ENCODER_CLK_PLUS_X1,

  /** Encoder mode: Directional Clock, x2 mode                                     */
  HAL_TIM_CLK_ENCODER_DIR_CLK_X2 = LL_TIM_CLK_ENCODER_DIR_CLK_X2,

  /** Encoder mode: Directional Clock, x1 mode,
      TI1FP1 and TI2FP2 edge sensitivity is set by CC1P and CC2P                   */
  HAL_TIM_CLK_ENCODER_DIR_CLK_X1_TI12 = LL_TIM_CLK_ENCODER_DIR_CLK_X1_TI12,

} hal_tim_clk_src_t;


/**
  * @brief HAL TIM Trigger Selection.
  */
typedef enum
{
  /** Internal Trigger 0 (ITR0) */
  HAL_TIM_TRIG_ITR0    = LL_TIM_TS_ITR0,

  /** Internal Trigger 1 (ITR1) */
  HAL_TIM_TRIG_ITR1    = LL_TIM_TS_ITR1,

  /** Internal Trigger 2 (ITR2) */
  HAL_TIM_TRIG_ITR2    = LL_TIM_TS_ITR2,

#if defined(TIM3)
  /** Internal Trigger 3 (ITR3) */
  HAL_TIM_TRIG_ITR3    = LL_TIM_TS_ITR3,
#endif /* TIM3 */

#if defined(TIM4)
  /** Internal Trigger 4 (ITR4) */
  HAL_TIM_TRIG_ITR4    = LL_TIM_TS_ITR4,
#endif /* TIM4 */

#if defined(TIM5)
  /** Internal Trigger 5 (ITR5) */
  HAL_TIM_TRIG_ITR5    = LL_TIM_TS_ITR5,
#endif /* TIM5 */

  /** Internal Trigger 6 (ITR6) */
  HAL_TIM_TRIG_ITR6    = LL_TIM_TS_ITR6,

  /** Internal Trigger 7 (ITR7) */
  HAL_TIM_TRIG_ITR7    = LL_TIM_TS_ITR7,

  /** Internal Trigger 8 (ITR8) */
  HAL_TIM_TRIG_ITR8    = LL_TIM_TS_ITR8,

  /** Internal Trigger 9 (ITR9) */
  HAL_TIM_TRIG_ITR9    = LL_TIM_TS_ITR9,

#if defined(TIM16)
  /** Internal Trigger 10 (ITR10) */
  HAL_TIM_TRIG_ITR10   = LL_TIM_TS_ITR10,

  /** Internal Trigger 11 (ITR11) */
  HAL_TIM_TRIG_ITR11   = LL_TIM_TS_ITR11,
#endif /* TIM16 */


  /** Timer Input 1 Edge Detector (TI1F_ED)  */
  HAL_TIM_TRIG_TI1F_ED = LL_TIM_TS_TI1F_ED,

  /** Filtered Timer Input 1 (TI1FP1)        */
  HAL_TIM_TRIG_TI1FP1  = LL_TIM_TS_TI1FP1,

  /** Filtered Timer Input 2 (TI2FP2)        */
  HAL_TIM_TRIG_TI2FP2  = LL_TIM_TS_TI2FP2,

  /** Filtered External Trigger input (ETRF) */
  HAL_TIM_TRIG_ETRF    = LL_TIM_TS_ETRF,

} hal_tim_trig_sel_t;


/**
  * @brief HAL TIM Clock selection.
  */
typedef struct
{
  /** TIM clock source. \n
      Specifies the source of the clock feeding the timer's prescaler. */
  hal_tim_clk_src_t clock_source;

  /** Input Trigger source. \n
      Specifies the trigger input to be used to synchronize the counter
      when HAL_TIM_CLK_EXTERNAL_MODE1 is selected as clock source. */
  hal_tim_trig_sel_t trigger;

} hal_tim_clock_sel_t;

/**
  * @brief HAL TIM Update Event Generation Status.
  */
typedef enum
{
  /** Update event is not generated */
  HAL_TIM_UPDATE_GENERATION_DISABLED = 0U,

  /** Update event is generated as per configured update event source */
  HAL_TIM_UPDATE_GENERATION_ENABLED  = 1U,

} hal_tim_update_generation_status_t;


/**
  * @brief  Update Event Source.
  */
typedef enum
{
  /** Update event is generated when:
      - The counter reaches overflow/underflow
      - The TIMx_EGR.UG bit is set by software
      - An internal/external trigger is active
        (through the slave mode controller)           */
  HAL_TIM_UPDATE_REGULAR = LL_TIM_UPDATESOURCE_REGULAR,

  /** Update event is generated only when the counter
      reaches overflow/underflow                      */
  HAL_TIM_UPDATE_COUNTER = LL_TIM_UPDATESOURCE_COUNTER,

} hal_tim_update_src_t;


/**
  * @brief HAL TIM Update Flag Remap Status.
  */
typedef enum
{
  /** UIF status bit is not copied to TIMx_CNT register bit 31  */
  HAL_TIM_UPDATE_FLAG_REMAP_DISABLED = 0U,

  /** UIF status bit is copied to TIMx_CNT register bit 31      */
  HAL_TIM_UPDATE_FLAG_REMAP_ENABLED  = 1U,

} hal_tim_update_flag_remap_status_t;


/**
  * @brief HAL TIM Auto-Reload Preload Status.
  */
typedef enum
{
  /** TIMx_ARR register is not preloaded  */
  HAL_TIM_AUTO_RELOAD_PRELOAD_DISABLED = 0U,

  /** TIMx_ARR register is preloaded      */
  HAL_TIM_AUTO_RELOAD_PRELOAD_ENABLED  = 1U,

} hal_tim_auto_reload_preload_status_t;


/**
  * @brief HAL TIM Digital Filter.
  */
typedef enum
{
  /** No filter, sampling is done at fDTS                       */
  HAL_TIM_FDIV1    = 0x00000000U,

  /** fSAMPLING=fTIM_KER_CK, N=2                                */
  HAL_TIM_FDIV1_N2 = 0x10000000U,

