MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** fSAMPLING=fTIM_KER_CK, N=4                                */
  HAL_TIM_FDIV1_N4 = 0x20000000U,

  /** fSAMPLING=fTIM_KER_CK, N=8                                */
  HAL_TIM_FDIV1_N8 = 0x30000000U,

  /** fSAMPLING=fDTS/2, N=6                                     */
  HAL_TIM_FDIV2_N6 = 0x40000000U,

  /** fSAMPLING=fDTS/2, N=8                                     */
  HAL_TIM_FDIV2_N8 = 0x50000000U,

  /** fSAMPLING=fDTS/4, N=6                                     */
  HAL_TIM_FDIV4_N6 = 0x60000000U,

  /** fSAMPLING=fDTS/4, N=8                                     */
  HAL_TIM_FDIV4_N8 = 0x70000000U,

  /** fSAMPLING=fDTS/8, N=6                                     */
  HAL_TIM_FDIV8_N6 = 0x80000000U,

  /** fSAMPLING=fDTS/8, N=8                                     */
  HAL_TIM_FDIV8_N8 = 0x90000000U,

  /** fSAMPLING=fDTS/16, N=5                                    */
  HAL_TIM_FDIV16_N5 = 0xA0000000U,

  /** fSAMPLING=fDTS/16, N=6                                    */
  HAL_TIM_FDIV16_N6 = 0xB0000000U,

  /** fSAMPLING=fDTS/16, N=8                                    */
  HAL_TIM_FDIV16_N8 = 0xC0000000U,

  /** fSAMPLING=fDTS/32, N=5                                    */
  HAL_TIM_FDIV32_N5 = 0xD0000000U,

  /** fSAMPLING=fDTS/32, N=6                                    */
  HAL_TIM_FDIV32_N6 = 0xE0000000U,

  /** fSAMPLING=fDTS/32, N=8                                    */
  HAL_TIM_FDIV32_N8 = 0xF0000000U,

} hal_tim_filter_t;


/**
  * @brief  HAL TIM Output Compare Unit identifier definition.
  */
typedef enum
{
  /** Timer output compare unit 1      */
  HAL_TIM_OC_COMPARE_UNIT_1   = LL_TIM_OC_COMPARE_UNIT_1,

  /** Timer output compare unit 2      */
  HAL_TIM_OC_COMPARE_UNIT_2   = LL_TIM_OC_COMPARE_UNIT_2,

  /** Timer output compare unit 3      */
  HAL_TIM_OC_COMPARE_UNIT_3   = LL_TIM_OC_COMPARE_UNIT_3,

  /** Timer output compare unit 4      */
  HAL_TIM_OC_COMPARE_UNIT_4   = LL_TIM_OC_COMPARE_UNIT_4,

  /** Timer output compare unit 5      */
  HAL_TIM_OC_COMPARE_UNIT_5   = LL_TIM_OC_COMPARE_UNIT_5,

  /** Timer output compare unit 6      */
  HAL_TIM_OC_COMPARE_UNIT_6   = LL_TIM_OC_COMPARE_UNIT_6,

  /** Timer output compare unit 7      */
  HAL_TIM_OC_COMPARE_UNIT_7   = LL_TIM_OC_COMPARE_UNIT_7,

} hal_tim_oc_compare_unit_t;


/**
  * @brief HAL TIM Output Channel Mode.
  */
typedef enum
{
  /** The comparison between the output compare register TIMx_CCRy and
      the counter TIMx_CNT has no effect on the output channel level   */
  HAL_TIM_OC_FROZEN = LL_TIM_OCMODE_FROZEN,

  /** Set channel to active level on match                             */
  HAL_TIM_OC_ACTIVE_ON_MATCH = LL_TIM_OCMODE_ACTIVE_ON_MATCH,

  /** Set channel to inactive level on match                           */
  HAL_TIM_OC_INACTIVE_ON_MATCH = LL_TIM_OCMODE_INACTIVE_ON_MATCH,

  /** Toggle mode                                                      */
  HAL_TIM_OC_TOGGLE = LL_TIM_OCMODE_TOGGLE,

  /** PWM mode 1                                                       */
  HAL_TIM_OC_PWM1 = LL_TIM_OCMODE_PWM1,

  /** PWM mode 2                                                       */
  HAL_TIM_OC_PWM2 = LL_TIM_OCMODE_PWM2,

  /** Force active level                                               */
  HAL_TIM_OC_FORCED_ACTIVE = LL_TIM_OCMODE_FORCED_ACTIVE,

  /** Force inactive level                                             */
  HAL_TIM_OC_FORCED_INACTIVE = LL_TIM_OCMODE_FORCED_INACTIVE,

  /** Retrigerrable OPM mode 1                                         */
  HAL_TIM_OC_RETRIGERRABLE_OPM1 = LL_TIM_OCMODE_RETRIGERRABLE_OPM1,

  /** Retrigerrable OPM mode 2                                         */
  HAL_TIM_OC_RETRIGERRABLE_OPM2 = LL_TIM_OCMODE_RETRIGERRABLE_OPM2,

  /** Combined PWM mode 1                                              */
  HAL_TIM_OC_COMBINED_PWM1 = LL_TIM_OCMODE_COMBINED_PWM1,

  /** Combined PWM mode 2                                              */
  HAL_TIM_OC_COMBINED_PWM2 = LL_TIM_OCMODE_COMBINED_PWM2,

  /** Combined PWM mode 3                                              */
  HAL_TIM_OC_COMBINED_PWM3 = LL_TIM_OCMODE_COMBINED_PWM3,

  /** Combined PWM mode 4                                              */
  HAL_TIM_OC_COMBINED_PWM4 = LL_TIM_OCMODE_COMBINED_PWM4,

  /** Asymmetric PWM mode 1                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM1 = LL_TIM_OCMODE_ASYMMETRIC_PWM1,

  /** Asymmetric PWM mode 2                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM2 = LL_TIM_OCMODE_ASYMMETRIC_PWM2,

  /** Asymmetric PWM mode 3                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM3 = LL_TIM_OCMODE_ASYMMETRIC_PWM3,

  /** Asymmetric PWM mode 4                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM4 = LL_TIM_OCMODE_ASYMMETRIC_PWM4,

  /** Asymmetric PWM mode 5                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM5 = LL_TIM_OCMODE_ASYMMETRIC_PWM5,

  /** Asymmetric PWM mode 6                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM6 = LL_TIM_OCMODE_ASYMMETRIC_PWM6,

  /** Asymmetric PWM mode 7                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM7 = LL_TIM_OCMODE_ASYMMETRIC_PWM7,

  /** Asymmetric PWM mode 8                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM8 = LL_TIM_OCMODE_ASYMMETRIC_PWM8,

  /** Asymmetric PWM mode 9                                            */
  HAL_TIM_OC_ASYMMETRIC_PWM9 = LL_TIM_OCMODE_ASYMMETRIC_PWM9,

  /** Asymmetric PWM mode 10                                           */
  HAL_TIM_OC_ASYMMETRIC_PWM10 = LL_TIM_OCMODE_ASYMMETRIC_PWM10,

  /** Pulse on compare (CH3 and CH4 only)                              */
  HAL_TIM_OC_PULSE_ON_COMPARE = LL_TIM_OCMODE_PULSE_ON_COMPARE,

  /** Direction output (CH3 and CH4 only)                              */
  HAL_TIM_OC_DIRECTION_OUTPUT = LL_TIM_OCMODE_DIRECTION_OUTPUT,

} hal_tim_oc_mode_t;


/**
  * @brief HAL TIM Output Channel Polarity.
  */
typedef enum
{
  /** Output Channel (complementary output channel) active high  */
  HAL_TIM_OC_HIGH = LL_TIM_OCPOLARITY_HIGH,

  /** Output Channel (complementary output channel) active low   */
  HAL_TIM_OC_LOW = LL_TIM_OCPOLARITY_LOW,

} hal_tim_oc_polarity_t;


/**
  * @brief HAL TIM Output Channel Idle State.
  */
typedef enum
{
  /** Output Idle state: OCx=0/OCxN=0 when MOE=0        */
  HAL_TIM_OC_IDLE_STATE_RESET = LL_TIM_OCIDLESTATE_RESET,

  /** Output Idle state: OCx=1/OCxN=1 when MOE=0       */
  HAL_TIM_OC_IDLE_STATE_SET   = LL_TIM_OCIDLESTATE_SET,

