MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
} hal_tim_oc_idle_state_t;


/**
  * @brief HAL TIM Output Channel Override State.
  */
typedef enum
{
  /** Output Override: OCx=0/OCxN=0 when OOC=1       */
  HAL_TIM_OC_OVERRIDE_RESET = LL_TIM_OCOVERRIDE_RESET,

  /** Output Override: OCx=1/OCxN=1 when OOC=1      */
  HAL_TIM_OC_OVERRIDE_SET   = LL_TIM_OCOVERRIDE_SET,

} hal_tim_oc_override_state_t;


/**
  * @brief HAL TIM Output Channel Break Mode.
  */
typedef enum
{
  /** Output break mode: Immediate break                     */
  HAL_TIM_OC_BREAKMODE_IMMEDIATE = LL_TIM_OCBREAKMODE_IMMEDIATE,

  /** Output break mode: Delayed 1 break                     */
  HAL_TIM_OC_BREAKMODE_DELAY1    = LL_TIM_OCBREAKMODE_DELAY1,

  /** Output break mode: Delayed 2 break                     */
  HAL_TIM_OC_BREAKMODE_DELAY2    = LL_TIM_OCBREAKMODE_DELAY2,

} hal_tim_oc_break_mode_t;


/**
  * @brief HAL TIM Output Channel Override Status.
  */
typedef enum
{
  /** Output override is disabled  */
  HAL_TIM_OC_OVERRIDE_DISABLED = 0U,

  /** Output override is enabled   */
  HAL_TIM_OC_OVERRIDE_ENABLED  = 1U,

} hal_tim_oc_output_override_status_t;


/**
  * @brief HAL TIM Output Compare Preload Status.
  */
typedef enum
{
  /** Output Compare preload is disabled  */
  HAL_TIM_OC_COMPARE_PRELOAD_DISABLED = 0U,

  /** Output Compare preload is enabled   */
  HAL_TIM_OC_COMPARE_PRELOAD_ENABLED  = 1U,

} hal_tim_oc_compare_preload_status_t;

/**
  * @brief HAL TIM Output Channel Fast Mode Status.
  */
typedef enum
{
  /** Output Compare fast mode is disabled  */
  HAL_TIM_OC_COMPARE_FAST_MODE_DISABLED = 0U,

  /** Output Compare fast mode is enabled   */
  HAL_TIM_OC_COMPARE_FAST_MODE_ENABLED  = 1U,

} hal_tim_oc_compare_fast_mode_status_t;


/**
  * @brief HAL TIM Pulse generator prescaler.
  */
typedef enum
{
  /** Pulse prescaler: tPWG = tTIM_KER_CK            */
  HAL_TIM_PULSE_DIV1   = LL_TIM_PWPRSC_DIV1,

  /** Pulse prescaler 2: tPWG = 2*tTIM_KER_CK        */
  HAL_TIM_PULSE_DIV2   = LL_TIM_PWPRSC_DIV2,

  /** Pulse prescaler 4: tPWG = 4*tTIM_KER_CK        */
  HAL_TIM_PULSE_DIV4   = LL_TIM_PWPRSC_DIV4,

  /** Pulse prescaler 8: tPWG = 8*tTIM_KER_CK        */
  HAL_TIM_PULSE_DIV8   = LL_TIM_PWPRSC_DIV8,

  /** Pulse prescaler 16: tPWG = 16*tTIM_KER_CK      */
  HAL_TIM_PULSE_DIV16  = LL_TIM_PWPRSC_DIV16,

  /** Pulse prescaler 32: tPWG = 32*tTIM_KER_CK      */
  HAL_TIM_PULSE_DIV32  = LL_TIM_PWPRSC_DIV32,

  /** Pulse prescaler 64: tPWG = 64*tTIM_KER_CK      */
  HAL_TIM_PULSE_DIV64  = LL_TIM_PWPRSC_DIV64,

  /** Pulse prescaler 128: tPWG = 128*tTIM_KER_CK    */
  HAL_TIM_PULSE_DIV128 = LL_TIM_PWPRSC_DIV128,

} hal_tim_pulse_prescaler_t;


/**
  * @brief HAL TIM Dithering pattern.
  */
typedef enum
{
  /** 0 duty cycle and / or period change over 16 consecutive periods */
  HAL_TIM_DITHERING_0_16 = 0U,

  /** 1 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_1_16,

  /** 2 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_2_16,

  /** 3 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_3_16,

  /** 4 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_4_16,

  /** 5 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_5_16,

  /** 6 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_6_16,

  /** 7 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_7_16,

  /** 8 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_8_16,

  /** 9 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_9_16,

  /** 10 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_10_16,

  /** 11 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_11_16,

  /** 12 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_12_16,

  /** 13 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_13_16,

  /** 14 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_14_16,

  /** 15 duty cycle and / or period changes over 16 consecutive periods */
  HAL_TIM_DITHERING_15_16,

} hal_tim_dithering_pattern_t;

/**
  * @brief HAL TIM Dithering status.
  */
typedef enum
{
  /** Dithering is disabled      */
  HAL_TIM_DITHERING_DISABLED = 0U,

  /** Dithering is enabled       */
  HAL_TIM_DITHERING_ENABLED  = 1U,

} hal_tim_dithering_status_t;


/**
  * @brief HAL TIM Input Capture Unit.
  */
typedef enum
{
  /** Input capture unit 1 */
  HAL_TIM_IC_CAPTURE_UNIT_1 = LL_TIM_CHANNEL_CH1,

  /** Input capture unit 2 */
  HAL_TIM_IC_CAPTURE_UNIT_2 = LL_TIM_CHANNEL_CH2,

  /** Input capture unit 3 */
  HAL_TIM_IC_CAPTURE_UNIT_3 = LL_TIM_CHANNEL_CH3,

  /** Input capture unit 4 */
  HAL_TIM_IC_CAPTURE_UNIT_4 = LL_TIM_CHANNEL_CH4,

} hal_tim_ic_capture_unit_t;


/**
  * @brief HAL TIM Input Channel Polarity.
  */
typedef enum
{
  /** Rising edges are detected on input channel                  */
  HAL_TIM_IC_RISING         = LL_TIM_IC_POLARITY_RISING,

  /** Falling edges are detected on input channel                 */
  HAL_TIM_IC_FALLING        = LL_TIM_IC_POLARITY_FALLING,

  /** Both rising and falling edges are detected on input channel */
  HAL_TIM_IC_RISING_FALLING = LL_TIM_IC_POLARITY_RISING_FALLING,

} hal_tim_ic_polarity_t;


/**
  * @brief HAL TIM Input Capture Source.
  */
typedef enum
{
  /** TIM Input 1, 2, 3 or 4 is selected to be connected to IC1, IC2,
      IC3 or IC4, respectively                                          */
  HAL_TIM_IC_DIRECT = LL_TIM_ACTIVEINPUT_DIRECT,

  /** TIM Input 1, 2, 3 or 4 is selected to be connected to
      IC2, IC1, IC4 or IC3, respectively with trigger on rising edge    */
  HAL_TIM_IC_INDIRECT_RISING = LL_TIM_ACTIVEINPUT_INDIRECT | LL_TIM_IC_POLARITY_RISING,

  /** TIM Input 1, 2, 3 or 4 edge is selected to be connected to
      IC2, IC1, IC4 or IC3, respectively with trigger on falling edge   */
  HAL_TIM_IC_INDIRECT_FALLING = LL_TIM_ACTIVEINPUT_INDIRECT | LL_TIM_IC_POLARITY_FALLING,

  /** TIM Input 1, 2, 3 or 4 rising edge is selected to be connected to
      IC2, IC1, IC4 or IC3, respectively with trigger on both edges     */
  HAL_TIM_IC_INDIRECT_RISING_FALLING = LL_TIM_ACTIVEINPUT_INDIRECT | LL_TIM_IC_POLARITY_RISING_FALLING,

