MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** TIM Input 1, 2, 3 or 4 is selected to be connected to TRC         */
  HAL_TIM_IC_TRC = LL_TIM_ACTIVEINPUT_TRC,

} hal_tim_ic_capture_unit_src_t;


/**
  * @brief HAL TIM Input Capture Unit Prescaler.
  */
typedef enum
{
  /** Capture performed each time an edge is detected on the capture input */
  HAL_TIM_IC_DIV1 = LL_TIM_ICPSC_DIV1,

  /** Capture performed once every 2 events                                */
  HAL_TIM_IC_DIV2 = LL_TIM_ICPSC_DIV2,

  /** Capture performed once every 4 events                                */
  HAL_TIM_IC_DIV4 = LL_TIM_ICPSC_DIV4,

  /** Capture performed once every 8 events                                */
  HAL_TIM_IC_DIV8 = LL_TIM_ICPSC_DIV8,

} hal_tim_ic_capture_unit_prescaler_t;


/**
  * @brief HAL TIM Input Channel XOR Gate Position.
  */
typedef enum
{
  /** XOR gate placed before TI1 filter                            */
  HAL_TIM_IC_XOR_GATE_POS_DIRECT   = LL_TIM_IC_XOR_GATE_POS_DIRECT,

  /** XOR gate placed after TI1, TI2 and TI3 filters,
      edge detector placed on XOR output                           */
  HAL_TIM_IC_XOR_GATE_POS_FILTERED = LL_TIM_IC_XOR_GATE_POS_FILTERED,

} hal_tim_ic_xor_gate_position_t;


/**
  * @brief HAL TIM Input Channel XOR Gate Input Signal Inversion status.
  */
typedef enum
{
  /** ICx is non-inverted on XOR gate input  */
  HAL_TIM_IC_XOR_GATE_INPUT_INV_DISABLED = 0U,

  /** ICx is inverted on XOR gate input      */
  HAL_TIM_IC_XOR_GATE_INPUT_INV_ENABLED  = 1U,

} hal_tim_ic_xor_gate_input_inversion_status_t;


/**
  * @brief HAL TIM Input Channel XOR Gate status.
  */
typedef enum
{
  /** XOR gate is disabled         */
  HAL_TIM_IC_XOR_GATE_DISABLED = 0U,

  /** XOR gate is enabled          */
  HAL_TIM_IC_XOR_GATE_ENABLED  = 1U,

} hal_tim_ic_xor_gate_status_t;


/**
  * @brief HAL TIM Input Channel Signal level.
  */
typedef enum
{
  /** Input channel signal level is low                */
  HAL_TIM_IC_CHANNEL_LEVEL_LOW  = LL_TIM_IC_SIGNAL_LOW,

  /** Input channel signal level is high               */
  HAL_TIM_IC_CHANNEL_LEVEL_HIGH = LL_TIM_IC_SIGNAL_HIGH,

} hal_tim_ic_channel_level_t;


/**
  * @brief TIM One-Pulse Mode status.
  */
typedef enum
{
  /** One-Pulse Mode is disabled      */
  HAL_TIM_ONE_PULSE_MODE_DISABLED = 0U,

  /** One-Pulse Mode is enabled       */
  HAL_TIM_ONE_PULSE_MODE_ENABLED  = 1U,

} hal_tim_one_pulse_mode_status_t;


/**
  * @brief TIM Encoder Index Direction (index_dir).
  */
typedef enum
{
  /** Index resets the counter whatever the direction  */
  HAL_TIM_ENCODER_INDEX_UP_DOWN = LL_TIM_INDEX_UP_DOWN,

  /** Index resets the counter when up-counting only   */
  HAL_TIM_ENCODER_INDEX_UP      = LL_TIM_INDEX_UP,

  /** Index resets the counter when down-counting only */
  HAL_TIM_ENCODER_INDEX_DOWN    = LL_TIM_INDEX_DOWN,

} hal_tim_encoder_index_dir_t;


/**
  * @brief TIM Encoder Index Blanking selection.
  */
typedef enum
{
  /** Index always active                                           */
  HAL_TIM_ENCODER_INDEX_BLANK_ALWAYS =  LL_TIM_INDEX_BLANK_ALWAYS,

  /** Index disabled when TI3 input is active, as per CC3P bitfield */
  HAL_TIM_ENCODER_INDEX_BLANK_TI3    =  LL_TIM_INDEX_BLANK_TI3,

  /** Index disabled when TI4 input is active, as per CC4P bitfield */
  HAL_TIM_ENCODER_INDEX_BLANK_TI4    =  LL_TIM_INDEX_BLANK_TI4,

} hal_tim_encoder_index_blank_mode_t;


/**
  * @brief TIM Encoder Index Positioning selection.
  */
typedef enum
{
  /** In quadrature encoder mode, the index event resets the counter
      when AB = 00                                                     */
  HAL_TIM_ENCODER_INDEX_POS_DOWN_DOWN = LL_TIM_INDEX_POSITION_DOWN_DOWN,

  /** In quadrature encoder mode, the index event resets the counter
      when AB = 01                                                     */
  HAL_TIM_ENCODER_INDEX_POS_DOWN_UP   = LL_TIM_INDEX_POSITION_DOWN_UP,

  /** In quadrature encoder mode, the index event resets the counter
      when AB = 10                                                     */
  HAL_TIM_ENCODER_INDEX_POS_UP_DOWN   = LL_TIM_INDEX_POSITION_UP_DOWN,

  /** In quadrature encoder mode, the index event resets the counter
      when AB = 11                                                     */
  HAL_TIM_ENCODER_INDEX_POS_UP_UP     = LL_TIM_INDEX_POSITION_UP_UP,

  /** In directional clock mode or clock plus direction mode, the index
      event resets the counter when clock is 0                         */
  HAL_TIM_ENCODER_INDEX_POS_DOWN      = LL_TIM_INDEX_POSITION_DOWN,

  /** In directional clock mode or clock plus direction mode, the index
      event resets the counter when clock is 1                         */
  HAL_TIM_ENCODER_INDEX_POS_UP        = LL_TIM_INDEX_POSITION_UP,

} hal_tim_encoder_index_pos_sel_t;


/**
  * @brief TIM Encoder Index selection.
  */
typedef enum
{
  /** Index is always active                                */
  HAL_TIM_ENCODER_INDEX_ALL = 0U,

  /** The first Index only resets the counter               */
  HAL_TIM_ENCODER_INDEX_FIRST_ONLY = LL_TIM_INDEX_FIRST_ONLY,

} hal_tim_encoder_index_sel_t;


/**
  * @brief TIM Encoder Index status.
  */
typedef enum
{
  /** Index input is disabled         */
  HAL_TIM_ENCODER_INDEX_DISABLED = 0U,

  /** Index input is enabled          */
  HAL_TIM_ENCODER_INDEX_ENABLED  = 1U,

} hal_tim_encoder_index_status_t;


/**
  * @brief HAL TIM External Trigger Polarity.
  */
typedef enum
{
  /** ETR input is active at high level or rising edge           */
  HAL_TIM_EXT_TRIG_NONINVERTED = LL_TIM_ETR_POLARITY_NONINVERTED,

  /** ETR input is active at low level or falling edge           */
  HAL_TIM_EXT_TRIG_INVERTED    = LL_TIM_ETR_POLARITY_INVERTED,

} hal_tim_ext_trig_polarity_t;


/**
  * @brief HAL TIM External Trigger Prescaler.
  */
typedef enum
{
  /** No prescaler is used                                                  */
  HAL_TIM_EXT_TRIG_DIV1 = LL_TIM_ETR_PRESCALER_DIV1,

  /** Prescaler for External Trigger: Capture performed once every 2 events */
  HAL_TIM_EXT_TRIG_DIV2 = LL_TIM_ETR_PRESCALER_DIV2,

  /** Prescaler for External Trigger: Capture performed once every 4 events */
  HAL_TIM_EXT_TRIG_DIV4 = LL_TIM_ETR_PRESCALER_DIV4,

  /** Prescaler for External Trigger: Capture performed once every 8 events */
  HAL_TIM_EXT_TRIG_DIV8 = LL_TIM_ETR_PRESCALER_DIV8,

} hal_tim_ext_trig_prescaler_t;


/**
  * @brief HAL TIM External Trigger Synchronous Prescaler.
  */
typedef enum
{
  /** No prescaler is used                                                  */
  HAL_TIM_EXT_TRIG_SYNC_DIV1 = LL_TIM_ETR_SYNC_PRESCALER_DIV1,

  /** Prescaler for External Trigger: Capture performed once every 2 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV2 = LL_TIM_ETR_SYNC_PRESCALER_DIV2,

  /** Prescaler for External Trigger: Capture performed once every 3 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV3 = LL_TIM_ETR_SYNC_PRESCALER_DIV3,

  /** Prescaler for External Trigger: Capture performed once every 4 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV4 = LL_TIM_ETR_SYNC_PRESCALER_DIV4,

  /** Prescaler for External Trigger: Capture performed once every 5 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV5 = LL_TIM_ETR_SYNC_PRESCALER_DIV5,

