MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** Prescaler for External Trigger: Capture performed once every 6 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV6 = LL_TIM_ETR_SYNC_PRESCALER_DIV6,

  /** Prescaler for External Trigger: Capture performed once every 7 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV7 = LL_TIM_ETR_SYNC_PRESCALER_DIV7,

  /** Prescaler for External Trigger: Capture performed once every 8 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV8 = LL_TIM_ETR_SYNC_PRESCALER_DIV8,

  /** Prescaler for External Trigger: Capture performed once every 9 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV9 = LL_TIM_ETR_SYNC_PRESCALER_DIV9,

  /** Prescaler for External Trigger: Capture performed once every 10 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV10 = LL_TIM_ETR_SYNC_PRESCALER_DIV10,

  /** Prescaler for External Trigger: Capture performed once every 11 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV11 = LL_TIM_ETR_SYNC_PRESCALER_DIV11,

  /** Prescaler for External Trigger: Capture performed once every 12 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV12 = LL_TIM_ETR_SYNC_PRESCALER_DIV12,

  /** Prescaler for External Trigger: Capture performed once every 13 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV13 = LL_TIM_ETR_SYNC_PRESCALER_DIV13,

  /** Prescaler for External Trigger: Capture performed once every 14 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV14 = LL_TIM_ETR_SYNC_PRESCALER_DIV14,

  /** Prescaler for External Trigger: Capture performed once every 15 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV15 = LL_TIM_ETR_SYNC_PRESCALER_DIV15,

  /** Prescaler for External Trigger: Capture performed once every 16 events */
  HAL_TIM_EXT_TRIG_SYNC_DIV16 = LL_TIM_ETR_SYNC_PRESCALER_DIV16,

} hal_tim_ext_trig_sync_prescaler_t;


/**
  * @brief HAL TIM External Trigger Source.
  * @note  The pattern of the enum constants is: HAL_TIM_EXT_TRIG_TIMx_<source>
  */
typedef enum
{
  /** TIM1 external trigger is connected to TIM1_ETR */
  HAL_TIM_EXT_TRIG_TIM1_GPIO = LL_TIM_TIM1_ETR_IN_GPIO,

  /** TIM1 external trigger is connected to comp1_out */
  HAL_TIM_EXT_TRIG_TIM1_COMP1_OUT = LL_TIM_TIM1_ETR_IN_COMP1_OUT,

#if defined(COMP2)
  /** TIM1 external trigger is connected to comp2_out */
  HAL_TIM_EXT_TRIG_TIM1_COMP2_OUT = LL_TIM_TIM1_ETR_IN_COMP2_OUT,
#endif /* COMP2 */


  /** TIM1 external trigger is connected to adc1_awd1 */
  HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD1 = LL_TIM_TIM1_ETR_IN_ADC1_AWD1,

  /** TIM1 external trigger is connected to adc1_awd2 */
  HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD2 = LL_TIM_TIM1_ETR_IN_ADC1_AWD2,

  /** TIM1 external trigger is connected to adc1_awd3 */
  HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD3 = LL_TIM_TIM1_ETR_IN_ADC1_AWD3,


  /** TIM2 external trigger is connected to TIM2_ETR */
  HAL_TIM_EXT_TRIG_TIM2_GPIO = LL_TIM_TIM2_ETR_IN_GPIO,

  /** TIM2 external trigger is connected to comp1_out */
  HAL_TIM_EXT_TRIG_TIM2_COMP1_OUT = LL_TIM_TIM2_ETR_IN_COMP1_OUT,

#if defined(COMP2)
  /** TIM2 external trigger is connected to comp2_out */
  HAL_TIM_EXT_TRIG_TIM2_COMP2_OUT = LL_TIM_TIM2_ETR_IN_COMP2_OUT,
#endif /* COMP2 */


  /** TIM2 external trigger is connected to adc1_awd1 */
  HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD1 = LL_TIM_TIM2_ETR_IN_ADC1_AWD1,

  /** TIM2 external trigger is connected to adc1_awd2 */
  HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD2 = LL_TIM_TIM2_ETR_IN_ADC1_AWD2,

  /** TIM2 external trigger is connected to adc1_awd3 */
  HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD3 = LL_TIM_TIM2_ETR_IN_ADC1_AWD3,

  /** TIM2 external trigger is connected to LSE */
  HAL_TIM_EXT_TRIG_TIM2_LSE = LL_TIM_TIM2_ETR_IN_LSE,

  /** TIM2 external trigger is connected to MCO1 */
  HAL_TIM_EXT_TRIG_TIM2_MCO1 = LL_TIM_TIM2_ETR_IN_MCO1,

#if defined(TIM3)
  /** TIM2 external trigger is connected to TIM3_ETR */
  HAL_TIM_EXT_TRIG_TIM2_TIM3_ETR = LL_TIM_TIM2_ETR_IN_TIM3_ETR,
#endif /* TIM3 */

#if defined(TIM4)
  /** TIM2 external trigger is connected to TIM4_ETR */
  HAL_TIM_EXT_TRIG_TIM2_TIM4_ETR = LL_TIM_TIM2_ETR_IN_TIM4_ETR,
#endif /* TIM4 */

#if defined(TIM5)
  /** TIM2 external trigger is connected to TIM5_ETR */
  HAL_TIM_EXT_TRIG_TIM2_TIM5_ETR = LL_TIM_TIM2_ETR_IN_TIM5_ETR,
#endif /* TIM5 */

#if defined(ETH1)
  /** TIM2 external trigger is connected to eth1_ptp_pps_out */
  HAL_TIM_EXT_TRIG_TIM2_ETH1_PTP_PPS_OUT = LL_TIM_TIM2_ETR_IN_ETH1_PTP_PPS_OUT,
#endif /* ETH1 */


#if defined(TIM3)
  /** TIM3 external trigger is connected to TIM3_ETR */
  HAL_TIM_EXT_TRIG_TIM3_GPIO  = LL_TIM_TIM3_ETR_IN_GPIO,

  /** TIM3 external trigger is connected to comp1_out */
  HAL_TIM_EXT_TRIG_TIM3_COMP1_OUT = LL_TIM_TIM3_ETR_IN_COMP1_OUT,

  /** TIM3 external trigger is connected to TIM2_ETR */
  HAL_TIM_EXT_TRIG_TIM3_TIM2_ETR = LL_TIM_TIM3_ETR_IN_TIM2_ETR,

#if defined(TIM4)
  /** TIM3 external trigger is connected to TIM4_ETR */
  HAL_TIM_EXT_TRIG_TIM3_TIM4_ETR = LL_TIM_TIM3_ETR_IN_TIM4_ETR,
#endif /* TIM4 */

  /** TIM3 external trigger is connected to TIM5_ETR */
  HAL_TIM_EXT_TRIG_TIM3_TIM5_ETR = LL_TIM_TIM3_ETR_IN_TIM5_ETR,


#if defined(ETH1)
  /** TIM3 external trigger is connected to eth1_ptp_pps_out */
  HAL_TIM_EXT_TRIG_TIM3_ETH1_PTP_PPS_OUT = LL_TIM_TIM3_ETR_IN_ETH1_PTP_PPS_OUT,
#endif /* ETH1 */
#endif /* TIM3 */


#if defined(TIM4)
  /** TIM4 external trigger is connected to TIM4_ETR */
  HAL_TIM_EXT_TRIG_TIM4_GPIO  = LL_TIM_TIM4_ETR_IN_GPIO,

  /** TIM4 external trigger is connected to comp1_out */
  HAL_TIM_EXT_TRIG_TIM4_COMP1_OUT = LL_TIM_TIM4_ETR_IN_COMP1_OUT,

  /** TIM4 external trigger is connected to adc3_awd1 */
  HAL_TIM_EXT_TRIG_TIM4_ADC3_AWD1 = LL_TIM_TIM4_ETR_IN_ADC3_AWD1,

  /** TIM4 external trigger is connected to adc3_awd2 */
  HAL_TIM_EXT_TRIG_TIM4_ADC3_AWD2 = LL_TIM_TIM4_ETR_IN_ADC3_AWD2,

  /** TIM4 external trigger is connected to adc3_awd3 */
  HAL_TIM_EXT_TRIG_TIM4_ADC3_AWD3 = LL_TIM_TIM4_ETR_IN_ADC3_AWD3,

  /** TIM4 external trigger is connected to TIM2_ETR */
  HAL_TIM_EXT_TRIG_TIM4_TIM2_ETR = LL_TIM_TIM4_ETR_IN_TIM2_ETR,

  /** TIM4 external trigger is connected to TIM3_ETR */
  HAL_TIM_EXT_TRIG_TIM4_TIM3_ETR = LL_TIM_TIM4_ETR_IN_TIM3_ETR,

  /** TIM4 external trigger is connected to TIM5_ETR */
  HAL_TIM_EXT_TRIG_TIM4_TIM5_ETR = LL_TIM_TIM4_ETR_IN_TIM5_ETR,
#endif /* TIM4 */


#if defined(TIM5)
  /** TIM5 external trigger is connected to TIM5_ETR */
  HAL_TIM_EXT_TRIG_TIM5_GPIO  = LL_TIM_TIM5_ETR_IN_GPIO,

  /** TIM5 external trigger is connected to comp1_out */
  HAL_TIM_EXT_TRIG_TIM5_COMP1_OUT = LL_TIM_TIM5_ETR_IN_COMP1_OUT,

