MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** TIM5 external trigger is connected to TIM2_ETR */
  HAL_TIM_EXT_TRIG_TIM5_TIM2_ETR = LL_TIM_TIM5_ETR_IN_TIM2_ETR,

#if defined(TIM3)
  /** TIM5 external trigger is connected to TIM3_ETR */
  HAL_TIM_EXT_TRIG_TIM5_TIM3_ETR = LL_TIM_TIM5_ETR_IN_TIM3_ETR,
#endif /* TIM3 */

#if defined(TIM4)
  /** TIM5 external trigger is connected to TIM4_ETR */
  HAL_TIM_EXT_TRIG_TIM5_TIM4_ETR = LL_TIM_TIM5_ETR_IN_TIM4_ETR,
#endif /* TIM4 */


#endif /* TIM5 */


  /** TIM8 external trigger is connected to TIM8_ETR */
  HAL_TIM_EXT_TRIG_TIM8_GPIO  = LL_TIM_TIM8_ETR_IN_GPIO,

  /** TIM8 external trigger is connected to comp1_out */
  HAL_TIM_EXT_TRIG_TIM8_COMP1_OUT = LL_TIM_TIM8_ETR_IN_COMP1_OUT,

#if defined(COMP2)
  /** TIM8 external trigger is connected to comp2_out */
  HAL_TIM_EXT_TRIG_TIM8_COMP2_OUT = LL_TIM_TIM8_ETR_IN_COMP2_OUT,
#endif /* COMP2 */


#if defined(ADC1) && defined(ADC2)
  /** TIM8 external trigger is connected to adc2_awd1 */
  HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD1 = LL_TIM_TIM8_ETR_IN_ADC2_AWD1,

  /** TIM8 external trigger is connected to adc2_awd2 */
  HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD2 = LL_TIM_TIM8_ETR_IN_ADC2_AWD2,

  /** TIM8 external trigger is connected to adc2_awd3 */
  HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD3 = LL_TIM_TIM8_ETR_IN_ADC2_AWD3,

#elif defined(ADC1)
  /** TIM8 external trigger is connected to adc1_awd1 */
  HAL_TIM_EXT_TRIG_TIM8_ADC1_AWD1 = LL_TIM_TIM8_ETR_IN_ADC1_AWD1,

  /** TIM8 external trigger is connected to adc1_awd2 */
  HAL_TIM_EXT_TRIG_TIM8_ADC1_AWD2 = LL_TIM_TIM8_ETR_IN_ADC1_AWD2,

  /** TIM8 external trigger is connected to adc1_awd3 */
  HAL_TIM_EXT_TRIG_TIM8_ADC1_AWD3 = LL_TIM_TIM8_ETR_IN_ADC1_AWD3,
#endif /* ADC1 && ADC2 */

#if defined(ADC3)
  /** TIM8 external trigger is connected to adc3_awd1 */
  HAL_TIM_EXT_TRIG_TIM8_ADC3_AWD1 = LL_TIM_TIM8_ETR_IN_ADC3_AWD1,

  /** TIM8 external trigger is connected to adc3_awd2 */
  HAL_TIM_EXT_TRIG_TIM8_ADC3_AWD2 = LL_TIM_TIM8_ETR_IN_ADC3_AWD2,

  /** TIM8 external trigger is connected to adc3_awd3 */
  HAL_TIM_EXT_TRIG_TIM8_ADC3_AWD3 = LL_TIM_TIM8_ETR_IN_ADC3_AWD3,
#endif /* ADC3 */

} hal_tim_ext_trig_src_t;


/**
  * @brief HAL TIM Input sources.
  * @note  The pattern of the enum constants is: HAL_TIM_INPUT_TIMx_TIy_<source>
  */
typedef enum
{
  /* TIM1 */
  /** TIM1 TI1 is connected to TIM1_CH1 */
  HAL_TIM_INPUT_TIM1_TI1_GPIO = LL_TIM_TIM1_TI1_GPIO,

  /** TIM1 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM1_TI1_COMP1_OUT = LL_TIM_TIM1_TI1_COMP1_OUT,

#if defined(COMP2)
  /** TIM1 TI1 is connected to comp2_out */
  HAL_TIM_INPUT_TIM1_TI1_COMP2_OUT = LL_TIM_TIM1_TI1_COMP2_OUT,
#endif /* COMP2 */

  /** TIM1 TI2 is connected to TIM1_CH2 */
  HAL_TIM_INPUT_TIM1_TI2_GPIO = LL_TIM_TIM1_TI2_GPIO,

  /** TIM1 TI3 is connected to TIM1_CH3 */
  HAL_TIM_INPUT_TIM1_TI3_GPIO = LL_TIM_TIM1_TI3_GPIO,

  /** TIM1 TI4 is connected to TIM1_CH4 */
  HAL_TIM_INPUT_TIM1_TI4_GPIO = LL_TIM_TIM1_TI4_GPIO,

  /* TIM2 */
  /** TIM2 TI1 is connected to TIM2_CH1 */
  HAL_TIM_INPUT_TIM2_TI1_GPIO = LL_TIM_TIM2_TI1_GPIO,

  /** TIM2 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM2_TI1_COMP1_OUT = LL_TIM_TIM2_TI1_COMP1_OUT,

#if defined(COMP2)
  /** TIM2 TI1 is connected to comp2_out */
  HAL_TIM_INPUT_TIM2_TI1_COMP2_OUT = LL_TIM_TIM2_TI1_COMP2_OUT,
#endif /* COMP2 */

#if defined(ETH1)
  /** TIM2 TI1 is connected to eth1_ptp_pps_out */
  HAL_TIM_INPUT_TIM2_TI1_ETH1_PTP_PPS_OUT = LL_TIM_TIM2_TI1_ETH1_PTP_PPS_OUT,
#endif /* ETH1 */

  /** TIM2 TI1 is connected to LSI */
  HAL_TIM_INPUT_TIM2_TI1_LSI = LL_TIM_TIM2_TI1_LSI,

  /** TIM2 TI1 is connected to LSE */
  HAL_TIM_INPUT_TIM2_TI1_LSE = LL_TIM_TIM2_TI1_LSE,

  /** TIM2 TI1 is connected to rtc_wut_trg */
  HAL_TIM_INPUT_TIM2_TI1_RTC_WUT_TRG = LL_TIM_TIM2_TI1_RTC_WUT_TRG,

#if defined(TIM5)
  /** TIM2 TI1 is connected to TIM5_CH1 */
  HAL_TIM_INPUT_TIM2_TI1_TIM5_CH1 = LL_TIM_TIM2_TI1_TIM5_CH1,
#endif /* TIM5 */

#if defined(FDCAN1)
  /** TIM2 TI1 is connected to fdcan1_rxeof_evt */
  HAL_TIM_INPUT_TIM2_TI1_FDCAN1_RXEOF_EVT = LL_TIM_TIM2_TI1_FDCAN1_RXEOF_EVT,
#endif /* FDCAN1 */

  /** TIM2 TI2 is connected to TIM2_CH2 */
  HAL_TIM_INPUT_TIM2_TI2_GPIO = LL_TIM_TIM2_TI2_GPIO,

  /** TIM2 TI2 is connected to hse_1M_ck */
  HAL_TIM_INPUT_TIM2_TI2_HSE_RTC = LL_TIM_TIM2_TI2_HSE_RTC,

  /** TIM2 TI2 is connected to MCO1 */
  HAL_TIM_INPUT_TIM2_TI2_MCO1 = LL_TIM_TIM2_TI2_MCO1,

  /** TIM2 TI2 is connected to MCO2 */
  HAL_TIM_INPUT_TIM2_TI2_MCO2 = LL_TIM_TIM2_TI2_MCO2,

#if defined(FDCAN1)
  /** TIM2 TI2 is connected to fdcan1_txeof_evt */
  HAL_TIM_INPUT_TIM2_TI2_FDCAN1_TXEOF_EVT = LL_TIM_TIM2_TI2_FDCAN1_TXEOF_EVT,
#endif /* FDCAN1 */

  /** TIM2 TI3 is connected to TIM2_CH3 */
  HAL_TIM_INPUT_TIM2_TI3_GPIO = LL_TIM_TIM2_TI3_GPIO,

#if defined(FDCAN2)
  /** TIM2 TI3 is connected to fdcan2_rxeof_evt */
  HAL_TIM_INPUT_TIM2_TI3_FDCAN2_RXEOF_EVT = LL_TIM_TIM2_TI3_FDCAN2_RXEOF_EVT,
#endif /* FDCAN2 */

  /** TIM2 TI4 is connected to TIM2_CH4 */
  HAL_TIM_INPUT_TIM2_TI4_GPIO = LL_TIM_TIM2_TI4_GPIO,

  /** TIM2 TI4 is connected to comp1_out */
  HAL_TIM_INPUT_TIM2_TI4_COMP1_OUT = LL_TIM_TIM2_TI4_COMP1_OUT,

#if defined(COMP2)
  /** TIM2 TI4 is connected to comp2_out */
  HAL_TIM_INPUT_TIM2_TI4_COMP2_OUT = LL_TIM_TIM2_TI4_COMP2_OUT,
#endif /* COMP2 */

#if defined(FDCAN2)
  /** TIM2 TI4 is connected to fdcan2_txeof_evt */
  HAL_TIM_INPUT_TIM2_TI4_FDCAN2_TXEOF_EVT = LL_TIM_TIM2_TI4_FDCAN2_TXEOF_EVT,
#endif /* FDCAN2 */

#if defined(TIM3)
  /* TIM3 */
  /** TIM3 TI1 is connected to TIM3_CH1 */
  HAL_TIM_INPUT_TIM3_TI1_GPIO = LL_TIM_TIM3_TI1_GPIO,

  /** TIM3 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM3_TI1_COMP1_OUT = LL_TIM_TIM3_TI1_COMP1_OUT,

#if defined(FDCAN2)
  /** TIM3 TI1 is connected to eth1_ptp_pps_out */
  HAL_TIM_INPUT_TIM3_TI1_ETH1_PTP_PPS_OUT = LL_TIM_TIM3_TI1_ETH1_PTP_PPS_OUT,

  /** TIM3 TI1 is connected to fdcan2_rxeof_evt */
  HAL_TIM_INPUT_TIM3_TI1_FDCAN2_RXEOF_EVT = LL_TIM_TIM3_TI1_FDCAN2_RXEOF_EVT,
#endif /* FDCAN2 */

  /** TIM3 TI2 is connected to TIM3_CH2 */
  HAL_TIM_INPUT_TIM3_TI2_GPIO = LL_TIM_TIM3_TI2_GPIO,

