MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
#if defined(FDCAN2)
  /** TIM3 TI2 is connected to fdcan2_txeof_evt */
  HAL_TIM_INPUT_TIM3_TI2_FDCAN2_TXEOF_EVT = LL_TIM_TIM3_TI2_FDCAN2_TXEOF_EVT,
#endif /* FDCAN2 */

  /** TIM3 TI3 is connected to TIM3_CH3 */
  HAL_TIM_INPUT_TIM3_TI3_GPIO = LL_TIM_TIM3_TI3_GPIO,

  /** TIM3 TI4 is connected to TIM3_CH4 */
  HAL_TIM_INPUT_TIM3_TI4_GPIO = LL_TIM_TIM3_TI4_GPIO,
#endif /* TIM3 */

#if defined(TIM4)
  /* TIM4 */
  /** TIM4 TI1 is connected to TIM4_CH1 */
  HAL_TIM_INPUT_TIM4_TI1_GPIO = LL_TIM_TIM4_TI1_GPIO,

  /** TIM4 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM4_TI1_COMP1_OUT = LL_TIM_TIM4_TI1_COMP1_OUT,

  /** TIM4 TI2 is connected to TIM4_CH2 */
  HAL_TIM_INPUT_TIM4_TI2_GPIO = LL_TIM_TIM4_TI2_GPIO,

  /** TIM4 TI3 is connected to TIM4_CH3 */
  HAL_TIM_INPUT_TIM4_TI3_GPIO = LL_TIM_TIM4_TI3_GPIO,

  /** TIM4 TI4 is connected to TIM4_CH4 */
  HAL_TIM_INPUT_TIM4_TI4_GPIO = LL_TIM_TIM4_TI4_GPIO,
#endif /* TIM4 */

#if defined(TIM5)
  /* TIM5 */
  /** TIM5 TI1 is connected to TIM5_CH1 */
  HAL_TIM_INPUT_TIM5_TI1_GPIO = LL_TIM_TIM5_TI1_GPIO,

  /** TIM5 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM5_TI1_COMP1_OUT = LL_TIM_TIM5_TI1_COMP1_OUT,

  /** TIM5 TI2 is connected to TIM5_CH2 */
  HAL_TIM_INPUT_TIM5_TI2_GPIO = LL_TIM_TIM5_TI2_GPIO,

  /** TIM5 TI3 is connected to TIM5_CH3 */
  HAL_TIM_INPUT_TIM5_TI3_GPIO = LL_TIM_TIM5_TI3_GPIO,

  /** TIM5 TI4 is connected to TIM5_CH4 */
  HAL_TIM_INPUT_TIM5_TI4_GPIO = LL_TIM_TIM5_TI4_GPIO,
#endif /* TIM5 */

  /* TIM8 */
  /** TIM8 TI1 is connected to TIM8_CH1 */
  HAL_TIM_INPUT_TIM8_TI1_GPIO = LL_TIM_TIM8_TI1_GPIO,

  /** TIM8 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM8_TI1_COMP1_OUT = LL_TIM_TIM8_TI1_COMP1_OUT,

#if defined(COMP2)
  /** TIM8 TI1 is connected to comp2_out */
  HAL_TIM_INPUT_TIM8_TI1_COMP2_OUT = LL_TIM_TIM8_TI1_COMP2_OUT,
#endif /* COMP2 */

  /** TIM8 TI2 is connected to TIM8_CH2 */
  HAL_TIM_INPUT_TIM8_TI2_GPIO = LL_TIM_TIM8_TI2_GPIO,

  /** TIM8 TI3 is connected to TIM8_CH3 */
  HAL_TIM_INPUT_TIM8_TI3_GPIO = LL_TIM_TIM8_TI3_GPIO,

  /** TIM8 TI4 is connected to TIM8_CH4 */
  HAL_TIM_INPUT_TIM8_TI4_GPIO = LL_TIM_TIM8_TI4_GPIO,

  /* TIM12 */
  /** TIM12 TI1 is connected to TIM12_CH1 */
  HAL_TIM_INPUT_TIM12_TI1_GPIO = LL_TIM_TIM12_TI1_GPIO,

  /** TIM12 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM12_TI1_COMP1_OUT = LL_TIM_TIM12_TI1_COMP1_OUT,

#if defined(COMP2)
  /** TIM12 TI1 is connected to comp2_out */
  HAL_TIM_INPUT_TIM12_TI1_COMP2_OUT = LL_TIM_TIM12_TI1_COMP2_OUT,
#endif /* COMP2 */

  /** TIM12 TI1 is connected to MCO1 */
  HAL_TIM_INPUT_TIM12_TI1_MCO1 = LL_TIM_TIM12_TI1_MCO1,

  /** TIM12 TI1 is connected to MCO2 */
  HAL_TIM_INPUT_TIM12_TI1_MCO2 = LL_TIM_TIM12_TI1_MCO2,

  /** TIM12 TI1 is connected to hse_1M_ck */
  HAL_TIM_INPUT_TIM12_TI1_HSE_RTC = LL_TIM_TIM12_TI1_HSE_RTC,

  /** TIM12 TI1 is connected to i3c1_ibi_ack */
  HAL_TIM_INPUT_TIM12_TI1_I3C1_IBI_ACK = LL_TIM_TIM12_TI1_I3C1_IBI_ACK,

  /** TIM12 TI2 is connected to TIM12_CH2 */
  HAL_TIM_INPUT_TIM12_TI2_GPIO = LL_TIM_TIM12_TI2_GPIO,

  /* TIM15 */
  /** TIM15 TI1 is connected to TIM15_CH1 */
  HAL_TIM_INPUT_TIM15_TI1_GPIO = LL_TIM_TIM15_TI1_GPIO,

  /** TIM15 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM15_TI1_COMP1_OUT = LL_TIM_TIM15_TI1_COMP1_OUT,

#if defined(COMP2)
  /** TIM15 TI1 is connected to comp2_out */
  HAL_TIM_INPUT_TIM15_TI1_COMP2_OUT = LL_TIM_TIM15_TI1_COMP2_OUT,
#endif /* COMP2 */

  /** TIM15 TI1 is connected to LSE */
  HAL_TIM_INPUT_TIM15_TI1_LSE = LL_TIM_TIM15_TI1_LSE,

#if defined(FDCAN2)
  /** TIM15 TI1 is connected to fdcan2_rxeof_evt */
  HAL_TIM_INPUT_TIM15_TI1_FDCAN2_RXEOF_EVT = LL_TIM_TIM15_TI1_FDCAN2_RXEOF_EVT,
#endif /* FDCAN2 */

  /** TIM15 TI2 is connected to TIM15_CH2 */
  HAL_TIM_INPUT_TIM15_TI2_GPIO = LL_TIM_TIM15_TI2_GPIO,

#if defined(FDCAN2)
  /** TIM15 TI2 is connected to fdcan2_txeof_evt */
  HAL_TIM_INPUT_TIM15_TI2_FDCAN2_TXEOF_EVT = LL_TIM_TIM15_TI2_FDCAN2_TXEOF_EVT,
#endif /* FDCAN2 */

#if defined(TIM16)
  /* TIM16 */
  /** TIM16 TI1 is connected to TIM16_CH1 */
  HAL_TIM_INPUT_TIM16_TI1_GPIO = LL_TIM_TIM16_TI1_GPIO,

  /** TIM16 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM16_TI1_COMP1_OUT = LL_TIM_TIM16_TI1_COMP1_OUT,

  /** TIM16 TI1 is connected to LSI */
  HAL_TIM_INPUT_TIM16_TI1_LSI = LL_TIM_TIM16_TI1_LSI,

  /** TIM16 TI1 is connected to LSE */
  HAL_TIM_INPUT_TIM16_TI1_LSE = LL_TIM_TIM16_TI1_LSE,

  /** TIM16 TI1 is connected to rtc_wut_trg */
  HAL_TIM_INPUT_TIM16_TI1_RTC_WUT_TRG = LL_TIM_TIM16_TI1_RTC_WUT_TRG,

  /** TIM16 TI1 is connected to MCO1 */
  HAL_TIM_INPUT_TIM16_TI1_MCO1 = LL_TIM_TIM16_TI1_MCO1,

  /** TIM16 TI1 is connected to MCO2 */
  HAL_TIM_INPUT_TIM16_TI1_MCO2 = LL_TIM_TIM16_TI1_MCO2,


  /* TIM17 */
  /** TIM17 TI1 is connected to TIM17_CH1 */
  HAL_TIM_INPUT_TIM17_TI1_GPIO = LL_TIM_TIM17_TI1_GPIO,

  /** TIM17 TI1 is connected to comp1_out */
  HAL_TIM_INPUT_TIM17_TI1_COMP1_OUT = LL_TIM_TIM17_TI1_COMP1_OUT,

  /** TIM17 TI1 is connected to hse_1M_ck */
  HAL_TIM_INPUT_TIM17_TI1_HSE_RTC = LL_TIM_TIM17_TI1_HSE_RTC,

  /** TIM17 TI1 is connected to MCO1 */
  HAL_TIM_INPUT_TIM17_TI1_MCO1 = LL_TIM_TIM17_TI1_MCO1,

  /** TIM17 TI1 is connected to MCO2 */
  HAL_TIM_INPUT_TIM17_TI1_MCO2 = LL_TIM_TIM17_TI1_MCO2,

  /** TIM17 TI1 is connected to i3c1_ibi_ack */
  HAL_TIM_INPUT_TIM17_TI1_I3C1_IBI_ACK = LL_TIM_TIM17_TI1_I3C1_IBI_ACK,
#endif /* TIM16 */

} hal_tim_channel_src_t;


/**
  * @brief HAL TIM Slave mode.
  */
typedef enum
{
  /** Slave mode disabled                                                         */
  HAL_TIM_SLAVE_DISABLED = LL_TIM_SLAVEMODE_DISABLED,

  /** Reset Mode
    *  Rising edge of the selected trigger input (TRGI) reinitializes the counter */
  HAL_TIM_SLAVE_RESET   = LL_TIM_SLAVEMODE_RESET,

  /** Gated Mode
    *  The counter clock is enabled when the trigger input (TRGI) is high         */
  HAL_TIM_SLAVE_GATED   = LL_TIM_SLAVEMODE_GATED,

  /** Trigger Mode
    *  The counter starts at a rising edge of the trigger TRGI                    */
  HAL_TIM_SLAVE_TRIGGER = LL_TIM_SLAVEMODE_TRIGGER,

  /** Combined reset + trigger mode
    *  Rising edge of the selected trigger input (TRGI) reinitializes the
    *  counter, generates an update of the registers and starts the counter       */
  HAL_TIM_SLAVE_COMBINED_RESET_TRIGGER = LL_TIM_SLAVEMODE_COMBINED_RESET_TRIGGER,

  /** Combined gated + reset mode
    *  The counter clock is enabled when the trigger input (TRGI) is high.
    *  The counter stops and is reset as soon as the trigger becomes low.
    *  Both start and stop of the counter are controlled.                         */
  HAL_TIM_SLAVE_COMBINED_GATED_RESET   = LL_TIM_SLAVEMODE_COMBINED_GATED_RESET,

