MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
} hal_tim_slave_mode_t;


/**
  * @brief HAL TIM Master Mode Selection of Trigger Output source.
  */
typedef enum
{
  /** TIMx_EGR.UG bit is used as trigger output (TRGO)               */
  HAL_TIM_TRGO_RESET = LL_TIM_TRGO_RESET,

  /** TIMx_CR1.CEN bit is used as trigger output (TRGO)              */
  HAL_TIM_TRGO_ENABLE = LL_TIM_TRGO_ENABLE,

  /** Update event is used as trigger output (TRGO)                  */
  HAL_TIM_TRGO_UPDATE = LL_TIM_TRGO_UPDATE,

  /** Capture or a compare match 1 is used as trigger output (TRGO)  */
  HAL_TIM_TRGO_CC1IF = LL_TIM_TRGO_CC1IF,

  /** OC1REFC signal is used as trigger output (TRGO)                */
  HAL_TIM_TRGO_OC1 = LL_TIM_TRGO_OC1,

  /** OC2REFC signal is used as trigger output (TRGO)                */
  HAL_TIM_TRGO_OC2 = LL_TIM_TRGO_OC2,

  /** OC3REFC signal is used as trigger output (TRGO)                */
  HAL_TIM_TRGO_OC3 = LL_TIM_TRGO_OC3,

  /** OC4REFC signal is used as trigger output (TRGO)                */
  HAL_TIM_TRGO_OC4 = LL_TIM_TRGO_OC4,

  /** Encoder clock is used as trigger output (TRGO)                 */
  HAL_TIM_TRGO_ENCODER_CLK = LL_TIM_TRGO_ENCODER_CLK,

} hal_tim_trigger_output_source_t;


/**
  * @brief HAL TIM Master Mode Selection of Trigger Output 2 source.
  */
typedef enum
{
  /** TIMx_EGR.UG bit is used as trigger output (TRGO2)               */
  HAL_TIM_TRGO2_RESET = LL_TIM_TRGO2_RESET,

  /** TIMx_CR1.CEN bit is used as trigger output (TRGO2)              */
  HAL_TIM_TRGO2_ENABLE = LL_TIM_TRGO2_ENABLE,

  /** Update event is used as trigger output (TRGO2)                  */
  HAL_TIM_TRGO2_UPDATE = LL_TIM_TRGO2_UPDATE,

  /** Capture or a compare match 1 is used as trigger output (TRGO2)  */
  HAL_TIM_TRGO2_CC1F = LL_TIM_TRGO2_CC1F,

  /** OC1REFC signal is used as trigger output (TRGO2)                 */
  HAL_TIM_TRGO2_OC1 = LL_TIM_TRGO2_OC1,

  /** OC2REFC signal is used as trigger output (TRGO2)                 */
  HAL_TIM_TRGO2_OC2 = LL_TIM_TRGO2_OC2,

  /** OC3REFC signal is used as trigger output (TRGO2)                 */
  HAL_TIM_TRGO2_OC3 = LL_TIM_TRGO2_OC3,

  /** OC4REFC signal is used as trigger output (TRGO2)                 */
  HAL_TIM_TRGO2_OC4 = LL_TIM_TRGO2_OC4,

  /** OC5REFC signal is used as trigger output (TRGO2)                 */
  HAL_TIM_TRGO2_OC5 = LL_TIM_TRGO2_OC5,

  /** OC6REFC signal is used as trigger output (TRGO2)                 */
  HAL_TIM_TRGO2_OC6 = LL_TIM_TRGO2_OC6,

  /** OC7REFC signal is used as trigger output (TRGO2)                 */
  HAL_TIM_TRGO2_OC7 = LL_TIM_TRGO2_OC7,

  /** OC4REFC rising or falling edges generate pulses on TRGO2         */
  HAL_TIM_TRGO2_OC4_RISING_FALLING = LL_TIM_TRGO2_OC4_RISING_FALLING,

  /** OC6REFC rising or falling edges generate pulses on TRGO2         */
  HAL_TIM_TRGO2_OC6_RISING_FALLING = LL_TIM_TRGO2_OC6_RISING_FALLING,

  /** OC7REFC rising or falling edges generate pulses on TRGO2         */
  HAL_TIM_TRGO2_OC7_RISING_FALLING = LL_TIM_TRGO2_OC7_RISING_FALLING,

  /** OC4REFC or OC6REFC rising edges generate pulses on TRGO2         */
  HAL_TIM_TRGO2_OC4_RISING_OC6_RISING = LL_TIM_TRGO2_OC4_RISING_OC6_RISING,

  /** OC4REFC or OC7REFC rising edges generate pulses on TRGO2         */
  HAL_TIM_TRGO2_OC4_RISING_OC7_RISING = LL_TIM_TRGO2_OC4_RISING_OC7_RISING,

  /** OC5REFC or OC6REFC rising edges generate pulses on TRGO2         */
  HAL_TIM_TRGO2_OC5_RISING_OC6_RISING = LL_TIM_TRGO2_OC5_RISING_OC6_RISING,

  /** OC5REFC or OC7REFC rising edges generate pulses on TRGO2         */
  HAL_TIM_TRGO2_OC5_RISING_OC7_RISING = LL_TIM_TRGO2_OC5_RISING_OC7_RISING,

  /** OC6REFC or OC7REFC rising edges generate pulses on TRGO2         */
  HAL_TIM_TRGO2_OC6_RISING_OC7_RISING = LL_TIM_TRGO2_OC6_RISING_OC7_RISING,

  /** OC4REFC rising or OC6REFC falling edges generate pulses on TRGO2 */
  HAL_TIM_TRGO2_OC4_RISING_OC6_FALLING = LL_TIM_TRGO2_OC4_RISING_OC6_FALLING,

  /** OC4REFC rising or OC7REFC falling edges generate pulses on TRGO2 */
  HAL_TIM_TRGO2_OC4_RISING_OC7_FALLING = LL_TIM_TRGO2_OC4_RISING_OC7_FALLING,

  /** OC5REFC rising or OC6REFC falling edges generate pulses on TRGO2 */
  HAL_TIM_TRGO2_OC5_RISING_OC6_FALLING = LL_TIM_TRGO2_OC5_RISING_OC6_FALLING,

  /** OC5REFC rising or OC7REFC falling edges generate pulses on TRGO2 */
  HAL_TIM_TRGO2_OC5_RISING_OC7_FALLING = LL_TIM_TRGO2_OC5_RISING_OC7_FALLING,

  /** OC6REFC rising or OC7REFC falling edges generate pulses on TRGO2 */
  HAL_TIM_TRGO2_OC6_RISING_OC7_FALLING = LL_TIM_TRGO2_OC6_RISING_OC7_FALLING,

} hal_tim_trigger_output2_source_t;


/**
  * @brief HAL TIM Slave Mode Preload Status.
  */
typedef enum
{
  /** Slave mode selection (SMS[3:0]) isn't preloaded */
  HAL_TIM_SLAVE_MODE_PRELOAD_DISABLED = 0U,

  /** Slave mode selection (SMS[3:0]) is preloaded    */
  HAL_TIM_SLAVE_MODE_PRELOAD_ENABLED  = 1U,

} hal_tim_slave_mode_preload_status_t;


/**
  * @brief Slave Mode Preload Source.
  */
typedef enum
{
  /** The transfer is triggered by the timer's Update event           */
  HAL_TIM_SLAVE_MODE_PRELOAD_UPDATE = LL_TIM_SLAVE_MODE_PRELOAD_UPDATE,

  /** The transfer is triggered by the Index event                    */
  HAL_TIM_SLAVE_MODE_PRELOAD_INDEX  = LL_TIM_SLAVE_MODE_PRELOAD_INDEX,

} hal_tim_slave_mode_preload_src_t;


/**
  * @brief TIM Master/Slave Mode.
  */
typedef enum
{
  /** No action */
  HAL_TIM_MASTER_SLAVE_MODE_DISABLED = 0x00000000U,

  /** Master/Slave mode is selected */
  HAL_TIM_MASTER_SLAVE_MODE_ENABLED  = 0x00000001U,

} hal_tim_master_slave_mode_status_t;


/**
  * @brief HAL TIM ADC Synchronization Status.
  */
typedef enum
{
  /** The timer operates independently from the ADC   */
  HAL_TIM_ADC_SYNCHRONIZATION_DISABLED = 0U,

  /** The timer operation is synchronized with the
    * ADC clock to provide jitter-free sampling point */
  HAL_TIM_ADC_SYNCHRONIZATION_ENABLED  = 1U,

} hal_tim_adc_synchronization_status_t;


/**
  * @brief  HAL TIM Output Compare Clear (ocrefclr) Status.
  */
typedef enum
{
  HAL_TIM_OCREFCLEAR_DISABLED = 0U,

