MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  HAL_TIM_OCREFCLEAR_ENABLED  = 1U,

} hal_tim_ocref_clr_status_t;


/**
  * @brief HAL TIM Output Compare Clear (ocrefclr) Sources.
  * @note  The pattern of the enum constants is: HAL_TIM_OCREF_CLR_TIMx_<source>
  */
typedef enum
{
  /** TIM1 OCREF clear input is connected to tim1_etrf */
  HAL_TIM_OCREF_CLR_TIM1_ETR = LL_TIM_TIM1_OCREF_CLR_INT_ETR,

  /** TIM1 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM1_COMP1_OUT = LL_TIM_TIM1_OCREF_CLR_INT_COMP1_OUT,

#if defined(COMP2)
  /** TIM1 OCREF clear input is connected to comp2_out */
  HAL_TIM_OCREF_CLR_TIM1_COMP2_OUT = LL_TIM_TIM1_OCREF_CLR_INT_COMP2_OUT,
#endif /* COMP2 */


  /** TIM2 OCREF clear input is connected to tim2_etrf */
  HAL_TIM_OCREF_CLR_TIM2_ETR = LL_TIM_TIM2_OCREF_CLR_INT_ETR,

  /** TIM2 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM2_COMP1_OUT = LL_TIM_TIM2_OCREF_CLR_INT_COMP1_OUT,

#if defined(COMP2)
  /** TIM2 OCREF clear input is connected to comp2_out */
  HAL_TIM_OCREF_CLR_TIM2_COMP2_OUT = LL_TIM_TIM2_OCREF_CLR_INT_COMP2_OUT,
#endif /* COMP2 */


#if defined(TIM3)
  /** TIM3 OCREF clear input is connected to tim3_etrf */
  HAL_TIM_OCREF_CLR_TIM3_ETR = LL_TIM_TIM3_OCREF_CLR_INT_ETR,

  /** TIM3 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM3_COMP1_OUT = LL_TIM_TIM3_OCREF_CLR_INT_COMP1_OUT,
#endif /* TIM3 */


#if defined(TIM4)
  /** TIM4 OCREF clear input is connected to tim4_etrf */
  HAL_TIM_OCREF_CLR_TIM4_ETR = LL_TIM_TIM4_OCREF_CLR_INT_ETR,

  /** TIM4 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM4_COMP1_OUT = LL_TIM_TIM4_OCREF_CLR_INT_COMP1_OUT,
#endif /* TIM4 */


#if defined(TIM5)
  /** TIM5 OCREF clear input is connected to tim5_etrf */
  HAL_TIM_OCREF_CLR_TIM5_ETR = LL_TIM_TIM5_OCREF_CLR_INT_ETR,

  /** TIM5 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM5_COMP1_OUT = LL_TIM_TIM5_OCREF_CLR_INT_COMP1_OUT,
#endif /* TIM5 */


  /** TIM8 OCREF clear input is connected to tim8_etrf */
  HAL_TIM_OCREF_CLR_TIM8_ETR = LL_TIM_TIM8_OCREF_CLR_INT_ETR,

  /** TIM8 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM8_COMP1_OUT = LL_TIM_TIM8_OCREF_CLR_INT_COMP1_OUT,

#if defined(COMP2)
  /** TIM8 OCREF clear input is connected to comp2_out */
  HAL_TIM_OCREF_CLR_TIM8_COMP2_OUT = LL_TIM_TIM8_OCREF_CLR_INT_COMP2_OUT,
#endif /* COMP2 */


  /** TIM15 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM15_COMP1_OUT = LL_TIM_TIM15_OCREF_CLR_INT_COMP1_OUT,

#if defined(COMP2)
  /** TIM15 OCREF clear input is connected to comp2_out */
  HAL_TIM_OCREF_CLR_TIM15_COMP2_OUT = LL_TIM_TIM15_OCREF_CLR_INT_COMP2_OUT,
#endif /* COMP2 */


#if defined(TIM16)
  /** TIM16 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM16_COMP1_OUT = LL_TIM_TIM16_OCREF_CLR_INT_COMP1_OUT,


  /** TIM17 OCREF clear input is connected to comp1_out */
  HAL_TIM_OCREF_CLR_TIM17_COMP1_OUT = LL_TIM_TIM17_OCREF_CLR_INT_COMP1_OUT,
#endif /* TIM16 */

} hal_tim_ocref_clr_src_t;


#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  *  @brief TIM DMA Handle Index
  */
typedef enum
{
  /** Index of the DMA handle used for Update DMA requests            */
  HAL_TIM_DMA_ID_UPD  = 0U,

  /** Index of the DMA handle used for Capture/Compare 1 DMA requests */
  HAL_TIM_DMA_ID_CC1  = 1U,

  /** Index of the DMA handle used for Capture/Compare 2 DMA requests */
  HAL_TIM_DMA_ID_CC2  = 2U,

  /** Index of the DMA handle used for Capture/Compare 3 DMA requests */
  HAL_TIM_DMA_ID_CC3  = 3U,

  /** Index of the DMA handle used for Capture/Compare 4 DMA requests */
  HAL_TIM_DMA_ID_CC4  = 4U,

  /** Index of the DMA handle used for Commutation DMA requests       */
  HAL_TIM_DMA_ID_COM  = 5U,

  /** Index of the DMA handle used for Trigger DMA requests           */
  HAL_TIM_DMA_ID_TRGI = 6U,

} hal_tim_dma_index_t;


/**
  * @brief  HAL TIM DMA Burst Base Address.
  */
typedef enum
{
  /** TIMx_CR1 register is the DMA base address for DMA burst         */
  HAL_TIM_DMABURST_BASE_ADDR_CR1   = LL_TIM_DMABURST_BASEADDR_CR1,

  /** TIMx_CR2 register is the DMA base address for DMA burst         */
  HAL_TIM_DMABURST_BASE_ADDR_CR2   = LL_TIM_DMABURST_BASEADDR_CR2,

  /** TIMx_SMCR register is the DMA base address for DMA burst       */
  HAL_TIM_DMABURST_BASE_ADDR_SMCR  = LL_TIM_DMABURST_BASEADDR_SMCR,

  /** TIMx_DIER register is the DMA base address for DMA burst       */
  HAL_TIM_DMABURST_BASE_ADDR_DIER  = LL_TIM_DMABURST_BASEADDR_DIER,

  /** TIMx_SR register is the DMA base address for DMA burst          */
  HAL_TIM_DMABURST_BASE_ADDR_SR    = LL_TIM_DMABURST_BASEADDR_SR,

  /** TIMx_EGR register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_EGR   = LL_TIM_DMABURST_BASEADDR_EGR,

  /** TIMx_CCMR1 register is the DMA base address for DMA burst       */
  HAL_TIM_DMABURST_BASE_ADDR_CCMR1 = LL_TIM_DMABURST_BASEADDR_CCMR1,

  /** TIMx_CCMR2 register is the DMA base address for DMA burst       */
  HAL_TIM_DMABURST_BASE_ADDR_CCMR2 = LL_TIM_DMABURST_BASEADDR_CCMR2,

  /** TIMx_CCER register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_CCER  = LL_TIM_DMABURST_BASEADDR_CCER,

  /** TIMx_CNT register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_CNT   = LL_TIM_DMABURST_BASEADDR_CNT,

  /** TIMx_PSC register is the DMA base address for DMA burst         */
  HAL_TIM_DMABURST_BASE_ADDR_PSC   = LL_TIM_DMABURST_BASEADDR_PSC,

  /** TIMx_ARR register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_ARR   = LL_TIM_DMABURST_BASEADDR_ARR,

  /** TIMx_RCR register is the DMA base address for DMA burst         */
  HAL_TIM_DMABURST_BASE_ADDR_RCR   = LL_TIM_DMABURST_BASEADDR_RCR,

  /** TIMx_CCR1 register is the DMA base address for DMA burst       */
  HAL_TIM_DMABURST_BASE_ADDR_CCR1  = LL_TIM_DMABURST_BASEADDR_CCR1,

  /** TIMx_CCR2 register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_CCR2  = LL_TIM_DMABURST_BASEADDR_CCR2,

