MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** TIMx_CCR3 register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_CCR3  = LL_TIM_DMABURST_BASEADDR_CCR3,

  /** TIMx_CCR4 register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_CCR4  = LL_TIM_DMABURST_BASEADDR_CCR4,

  /** TIMx_BDTR register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_BDTR  = LL_TIM_DMABURST_BASEADDR_BDTR,

  /** TIMx_CCR5 register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_CCR5  = LL_TIM_DMABURST_BASEADDR_CCR5,

  /** TIMx_CCR6 register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_CCR6  = LL_TIM_DMABURST_BASEADDR_CCR6,

  /** TIMx_CCMR3 register is the DMA base address for DMA burst       */
  HAL_TIM_DMABURST_BASE_ADDR_CCMR3 = LL_TIM_DMABURST_BASEADDR_CCMR3,

  /** TIMx_DTR2 register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_DTR2  = LL_TIM_DMABURST_BASEADDR_DTR2,

  /** TIMx_ECR register is the DMA base address for DMA burst         */
  HAL_TIM_DMABURST_BASE_ADDR_ECR   = LL_TIM_DMABURST_BASEADDR_ECR,

  /** TIMx_TISEL register is the DMA base address for DMA burst       */
  HAL_TIM_DMABURST_BASE_ADDR_TISEL = LL_TIM_DMABURST_BASEADDR_TISEL,

  /** TIMx_AF1 register is the DMA base address for DMA burst         */
  HAL_TIM_DMABURST_BASE_ADDR_AF1   = LL_TIM_DMABURST_BASEADDR_AF1,

  /** TIMx_AF2 register is the DMA base address for DMA burst         */
  HAL_TIM_DMABURST_BASE_ADDR_AF2   = LL_TIM_DMABURST_BASEADDR_AF2,

  /** TIMx_CCR7 register is the DMA base address for DMA burst        */
  HAL_TIM_DMABURST_BASE_ADDR_CCR7  = LL_TIM_DMABURST_BASEADDR_CCR7,

  /** TIMx_CCMR4 register is the DMA base address for DMA burst       */
  HAL_TIM_DMABURST_BASE_ADDR_CCMR4 = LL_TIM_DMABURST_BASEADDR_CCMR4,

} hal_tim_dmaburst_base_addr_reg_t;


/**
  * @brief HAL TIM DMA Burst triggering sources.
  */
typedef enum
{
  /** DMA burst is triggered by the update event                   */
  HAL_TIM_DMABURST_UPD  = LL_TIM_DMABURST_UPD,

  /** DMA burst is triggered by the capture/compare match 1 event  */
  HAL_TIM_DMABURST_CC1  = LL_TIM_DMABURST_CC1,

  /** DMA burst is triggered by the capture/compare match 2 event  */
  HAL_TIM_DMABURST_CC2  = LL_TIM_DMABURST_CC2,

  /** DMA burst is triggered by the capture/compare match 3 event  */
  HAL_TIM_DMABURST_CC3  = LL_TIM_DMABURST_CC3,

  /** DMA burst is triggered by the capture/compare match 4 event  */
  HAL_TIM_DMABURST_CC4  = LL_TIM_DMABURST_CC4,

  /** DMA burst is triggered by the commutation event              */
  HAL_TIM_DMABURST_COM  = LL_TIM_DMABURST_COM,

  /** DMA burst is triggered by the trigger event                  */
  HAL_TIM_DMABURST_TRGI = LL_TIM_DMABURST_TRGI,

} hal_tim_dmaburst_source_t;


/**
  * @brief TIM DMA Burst triggering sources.
  * @note  DMA Burst sources mapped on hal_tim_dmaburst_source_t
  *        for internal usage.
  */
typedef enum
{
  /** DMA burst is not used                                             */
  TIM_DMABURST_NONE = 0U,

  /** DMA burst is triggered by the update event                        */
  TIM_DMABURST_UPD  = HAL_TIM_DMABURST_UPD,

  /** DMA burst is triggered by the capture/compare match 1 event       */
  TIM_DMABURST_CC1  = HAL_TIM_DMABURST_CC1,

  /** DMA burst is triggered by the capture/compare match 2 event event */
  TIM_DMABURST_CC2  = HAL_TIM_DMABURST_CC2,

  /** DMA burst is triggered by the capture/compare match 3 event event */
  TIM_DMABURST_CC3  = HAL_TIM_DMABURST_CC3,

  /** DMA burst is triggered by the capture/compare match 4 event event */
  TIM_DMABURST_CC4  = HAL_TIM_DMABURST_CC4,

  /** DMA burst is triggered by the commutation event                   */
  TIM_DMABURST_COM  = HAL_TIM_DMABURST_COM,

  /** DMA burst is triggered by the trigger event                       */
  TIM_DMABURST_TRGI = HAL_TIM_DMABURST_TRGI,

} tim_dmaburst_source_t;


/**
  * @brief HAL TIM DMA Burst Length.
  */
typedef enum
{
  /** The transfer is done to 1 register starting from the DMA burst base address   */
  HAL_TIM_DMABURST_1TRANSFER   = LL_TIM_DMABURST_LENGTH_1TRANSFER,

  /** The transfer is done to 2 registers starting from the DMA burst base address  */
  HAL_TIM_DMABURST_2TRANSFERS  = LL_TIM_DMABURST_LENGTH_2TRANSFERS,

  /** The transfer is done to 3 registers starting from the DMA burst base address  */
  HAL_TIM_DMABURST_3TRANSFERS  = LL_TIM_DMABURST_LENGTH_3TRANSFERS,

  /** The transfer is done to 4 registers starting from the DMA burst base address  */
  HAL_TIM_DMABURST_4TRANSFERS  = LL_TIM_DMABURST_LENGTH_4TRANSFERS,

  /** The transfer is done to 5 registers starting from the DMA burst base address  */
  HAL_TIM_DMABURST_5TRANSFERS  = LL_TIM_DMABURST_LENGTH_5TRANSFERS,

  /** The transfer is done to 6 registers starting from the DMA burst base address  */
  HAL_TIM_DMABURST_6TRANSFERS  = LL_TIM_DMABURST_LENGTH_6TRANSFERS,

  /** The transfer is done to 7 registers starting from the DMA burst base address  */
  HAL_TIM_DMABURST_7TRANSFERS  = LL_TIM_DMABURST_LENGTH_7TRANSFERS,

  /** The transfer is done to 8 registers starting from the DMA burst base address  */
  HAL_TIM_DMABURST_8TRANSFERS  = LL_TIM_DMABURST_LENGTH_8TRANSFERS,

  /** The transfer is done to 9 registers starting from the DMA burst base address  */
  HAL_TIM_DMABURST_9TRANSFERS  = LL_TIM_DMABURST_LENGTH_9TRANSFERS,

  /** The transfer is done to 10 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_10TRANSFERS = LL_TIM_DMABURST_LENGTH_10TRANSFERS,

  /** The transfer is done to 11 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_11TRANSFERS = LL_TIM_DMABURST_LENGTH_11TRANSFERS,

  /** The transfer is done to 12 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_12TRANSFERS = LL_TIM_DMABURST_LENGTH_12TRANSFERS,

  /** The transfer is done to 13 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_13TRANSFERS = LL_TIM_DMABURST_LENGTH_13TRANSFERS,

  /** The transfer is done to 14 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_14TRANSFERS = LL_TIM_DMABURST_LENGTH_14TRANSFERS,

  /** The transfer is done to 15 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_15TRANSFERS = LL_TIM_DMABURST_LENGTH_15TRANSFERS,

  /** The transfer is done to 16 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_16TRANSFERS = LL_TIM_DMABURST_LENGTH_16TRANSFERS,

  /** The transfer is done to 17 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_17TRANSFERS = LL_TIM_DMABURST_LENGTH_17TRANSFERS,

