MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** The transfer is done to 18 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_18TRANSFERS = LL_TIM_DMABURST_LENGTH_18TRANSFERS,

  /** The transfer is done to 19 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_19TRANSFERS = LL_TIM_DMABURST_LENGTH_19TRANSFERS,

  /** The transfer is done to 20 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_20TRANSFERS = LL_TIM_DMABURST_LENGTH_20TRANSFERS,

  /** The transfer is done to 21 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_21TRANSFERS = LL_TIM_DMABURST_LENGTH_21TRANSFERS,

  /** The transfer is done to 22 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_22TRANSFERS = LL_TIM_DMABURST_LENGTH_22TRANSFERS,

  /** The transfer is done to 23 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_23TRANSFERS = LL_TIM_DMABURST_LENGTH_23TRANSFERS,

  /** The transfer is done to 24 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_24TRANSFERS = LL_TIM_DMABURST_LENGTH_24TRANSFERS,

  /** The transfer is done to 25 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_25TRANSFERS = LL_TIM_DMABURST_LENGTH_25TRANSFERS,

  /** The transfer is done to 26 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_26TRANSFERS = LL_TIM_DMABURST_LENGTH_26TRANSFERS,

  /** The transfer is done to 27 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_27TRANSFERS = LL_TIM_DMABURST_LENGTH_27TRANSFERS,

  /** The transfer is done to 28 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_28TRANSFERS = LL_TIM_DMABURST_LENGTH_28TRANSFERS,

  /** The transfer is done to 29 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_29TRANSFERS = LL_TIM_DMABURST_LENGTH_29TRANSFERS,

  /** The transfer is done to 30 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_30TRANSFERS = LL_TIM_DMABURST_LENGTH_30TRANSFERS,

  /** The transfer is done to 31 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_31TRANSFERS = LL_TIM_DMABURST_LENGTH_31TRANSFERS,

  /** The transfer is done to 32 registers starting from the DMA burst base address */
  HAL_TIM_DMABURST_32TRANSFERS = LL_TIM_DMABURST_LENGTH_32TRANSFERS,

} hal_tim_dmaburst_length_t;

/**
  * @brief HAL TIM DMA Burst Direction.
  */
typedef enum
{
  /** DMA Burst read operation to transfer Data from the TIM peripheral to the memory */
  HAL_TIM_DMABURST_READ  = 0U,

  /** DMA Burst write operation to transfer Data from the memory to the TIM peripheral */
  HAL_TIM_DMABURST_WRITE = 1U,

} hal_tim_dmaburst_direction_t;
#endif /* USE_HAL_TIM_DMA */


/**
  * @brief  HAL TIM Break Input.
  */
typedef enum
{
  /** Timer break input 1                          */
  HAL_TIM_BREAK_INPUT_1  = LL_TIM_BREAK_INPUT_1,

  /** Timer break input 2                          */
  HAL_TIM_BREAK_INPUT_2  = LL_TIM_BREAK_INPUT_2,

} hal_tim_break_input_id_t;


/**
  * @brief HAL TIM Break Input Polarity.
  */
typedef enum
{
  /** Break input is active low                        */
  HAL_TIM_BREAK_INPUT_LOW  = LL_TIM_BREAK_POLARITY_LOW,

  /** Break input is active high                       */
  HAL_TIM_BREAK_INPUT_HIGH = LL_TIM_BREAK_POLARITY_HIGH,

} hal_tim_break_input_polarity_t;


/**
  * @brief HAL TIM Break Input Function Mode.
  */
typedef enum
{
  /** Break input in input mode                                                */
  HAL_TIM_BREAK_INPUT_MODE_INPUT = LL_TIM_BREAK_AFMODE_INPUT,

  /** Break input in bidirectional mode.
    *  In bidirectional mode the Break input is configured
    *  both in input mode and in open drain output mode.
    *  Any active Break event will assert a low logic level on the Break
    *  input to indicate an internal break event to external devices.          */
  HAL_TIM_BREAK_INPUT_MODE_BIDIRECTIONAL = (LL_TIM_BREAK_AFMODE_BIDIRECTIONAL |
                                            LL_TIM_BREAK2_AFMODE_BIDIRECTIONAL),

} hal_tim_break_input_mode_t;


/**
  * @brief HAL TIM Break Input status.
  */
typedef enum
{
  /** Break input is disabled      */
  HAL_TIM_BREAK_INPUT_DISABLED = 0U,

  /** Break input is enabled       */
  HAL_TIM_BREAK_INPUT_ENABLED  = 1U,

} hal_tim_break_input_status_t;


/**
  * @brief HAL TIM Break Input Source Polarity.
  */
typedef enum
{
  /** Break input source polarity is not inverted                         */
  HAL_TIM_BREAK_INPUT_SRC_NONINVERTED = LL_TIM_BREAK_INPUT_SRC_NONINVERTED,

  /** Break input source polarity is inverted                             */
  HAL_TIM_BREAK_INPUT_SRC_INVERTED = LL_TIM_BREAK_INPUT_SRC_INVERTED,

} hal_tim_break_input_src_polarity_t;


/**
  * @brief HAL TIM Break Input Source Status.
  */
typedef enum
{
  /** Break input source is disabled   */
  HAL_TIM_BREAK_INPUT_SRC_DISABLED = 0U,

  /** Break input source is enabled    */
  HAL_TIM_BREAK_INPUT_SRC_ENABLED = 1U,

} hal_tim_break_input_src_status_t;


/**
  * @brief HAL TIM Main Output status.
  */
typedef enum
{
  /** Main output is disabled            */
  HAL_TIM_BREAK_MAIN_OUTPUT_DISABLED = 0U,

  /** Main output is enabled             */
  HAL_TIM_BREAK_MAIN_OUTPUT_ENABLED  = 1U,

} hal_tim_break_main_output_status_t;


/**
  * @brief HAL TIM Automatic Output status.
  */
typedef enum
{
  /** Main output can only be enabled by software                       */
  HAL_TIM_BREAK_AUTOMATIC_OUTPUT_DISABLED = 0U,

  /** Main output can be enabled by software or automatically at the next
      update event (if none of the break inputs BRK and BRK2 is active) */
  HAL_TIM_BREAK_AUTOMATIC_OUTPUT_ENABLED = 1U,

} hal_tim_break_automatic_output_status_t;

/**
  * @brief HAL TIM Break Delay.
  */
typedef enum
{
  /** Delayed 1 break                       */
  HAL_TIM_BREAK_DELAY1 = LL_TIM_BREAK_DELAY1,

  /** Delayed 2 break                       */
  HAL_TIM_BREAK_DELAY2 = LL_TIM_BREAK_DELAY2,

} hal_tim_break_delay_t;


/**
  * @brief Off-state selection for run (ossr) mode.
  */
typedef enum
{
  /** When inactive, OCx/OCxN outputs are disabled (forced to Hi-Z state) */
  HAL_TIM_OFF_STATE_RUN_DISABLE = LL_TIM_OSSR_DISABLE,

  /** When inactive, OCx/OCxN outputs are enabled with their inactive
      level as soon as CCxE=1 or CCxNE=1                                  */
  HAL_TIM_OFF_STATE_RUN_ENABLE  = LL_TIM_OSSR_ENABLE,

} hal_tim_off_state_run_t;


/**
  * @brief Off-state selection for idle (ossi) mode.
  */
typedef enum
{
  /** When inactive, OCx/OCxN outputs are disabled (forced to Hi-Z state)  */
  HAL_TIM_OFF_STATE_IDLE_DISABLE = LL_TIM_OSSI_DISABLE,

  /** When inactive, OxC/OCxN outputs are first forced with their inactive
      level then forced to their idle level after the deadtime             */
  HAL_TIM_OFF_STATE_IDLE_ENABLE = LL_TIM_OSSI_ENABLE,

} hal_tim_off_state_idle_t;


/**
  * @brief HAL TIM output disable status.
  */
typedef enum
{
  /** Break was triggered (or MOE was written to 0), tim_ocx and
      tim_ocxn are forced to their Output idle state (OIS)       */
  HAL_TIM_OUTPUT_IDLE_STATE = LL_TIM_OUTPUT_IDLE_STATE,

  /** Break2 was triggered, tim_ocx and tim_ocxn outputs are
      forced to their inactive level                             */
  HAL_TIM_OUTPUT_DISABLED_STATE = LL_TIM_OUTPUT_DISABLED_STATE,

} hal_tim_output_disable_status_t;


/**
  * @brief HAL TIM deadtime preload status.
  */
typedef enum
{
  /** Deadtime preload is disabled       */
  HAL_TIM_DEADTIME_PRELOAD_DISABLED = 0U,

  /** Deadtime preload is enabled        */
  HAL_TIM_DEADTIME_PRELOAD_ENABLED  = 1U,

} hal_tim_deadtime_preload_status_t;

/**
  * @brief HAL TIM asymmetrical deadtime status.
  */
typedef enum
{
  /** Asymmetrical deadtime is disabled       */
  HAL_TIM_ASYMMETRICAL_DEADTIME_DISABLED = 0U,

  /** Asymmetrical deadtime is enabled        */
  HAL_TIM_ASYMMETRICAL_DEADTIME_ENABLED  = 1U,

} hal_tim_asymmetrical_deadtime_status_t;


/**
  * @brief  HAL TIM write protection levels definition.
  */
typedef enum
{
  /** LOCK OFF - No bit is write protected */
  HAL_TIM_LOCK_OFF = LL_TIM_LOCKLEVEL_OFF,

  /** LOCK Level 1                         */
  HAL_TIM_LOCK_1   = LL_TIM_LOCKLEVEL_1,

  /** LOCK Level 2                         */
  HAL_TIM_LOCK_2   = LL_TIM_LOCKLEVEL_2,

