MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** LOCK Level 3                         */
  HAL_TIM_LOCK_3   = LL_TIM_LOCKLEVEL_3,

} hal_tim_lock_level_t;


/**
  * @brief HAL TIM Commutation trigger selection.
  */
typedef enum
{
  /** Capture/compare control bits are updated by setting the COMG bit only            */
  HAL_TIM_COMMUTATION_SOFTWARE = LL_TIM_CCUPDATESOURCE_SOFTWARE,

  /** Capture/compare control bits are updated by setting the COMG bit or
      when a rising edge occurs on trigger input                                       */
  HAL_TIM_COMMUTATION_SOFTWARE_AND_TRIGGER = LL_TIM_CCUPDATESOURCE_SOFTWARE_AND_TRIGGER,

} hal_tim_commutation_src_t;


/**
  * @brief HAL TIM Commutation status.
  */
typedef enum
{
  /** Commutation is disabled      */
  HAL_TIM_COMMUTATION_DISABLED = 0U,

  /** Commutation is enabled       */
  HAL_TIM_COMMUTATION_ENABLED = 1U,

} hal_tim_commutation_status_t;


#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief HAL TIM Capture/Compare DMA Request Source.
  */
typedef enum
{
  /** CCx DMA request sent when CCx event occurs     */
  HAL_TIM_CC_DMAREQ_CC = LL_TIM_CCDMAREQUEST_CC,

  /** CCx DMA requests sent when update event occurs */
  HAL_TIM_CC_DMAREQ_UPD = LL_TIM_CCDMAREQUEST_UPD,

} hal_tim_cc_dmareq_src_t;
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  HAL TIM Software Event definition.
  */
typedef enum
{
  /** Reinitialize the counter and generates an update of the registers */
  HAL_TIM_SW_EVENT_UPD  = LL_TIM_SW_EVENT_UPD,

  /** A capture/compare event is generated on channel 1                 */
  HAL_TIM_SW_EVENT_CC1  = LL_TIM_SW_EVENT_CC1,

  /** A capture/compare event is generated on channel 2                 */
  HAL_TIM_SW_EVENT_CC2  = LL_TIM_SW_EVENT_CC2,

  /** A capture/compare event is generated on channel 3                 */
  HAL_TIM_SW_EVENT_CC3  = LL_TIM_SW_EVENT_CC3,

  /** A capture/compare event is generated on channel 4                 */
  HAL_TIM_SW_EVENT_CC4  = LL_TIM_SW_EVENT_CC4,

  /** A commutation event is generated                                  */
  HAL_TIM_SW_EVENT_COM  = LL_TIM_SW_EVENT_COM,

  /** A trigger event is generated                                      */
  HAL_TIM_SW_EVENT_TRGI = LL_TIM_SW_EVENT_TRGI,

  /** A break event is generated                                        */
  HAL_TIM_SW_EVENT_BRK  = LL_TIM_SW_EVENT_BRK,

  /** A break 2 event is generated                                      */
  HAL_TIM_SW_EVENT_BRK2 = LL_TIM_SW_EVENT_BRK2,

} hal_tim_sw_event_id_t;


/**
  * @brief HAL TIM Time Base Configuration Structure definition.
  * @note :
  *        The update event period is calculated as follows:
  *        update_event = TIM_CLK/((prescaler + 1)*(period + 1)*(repetition + 1))
  */
typedef struct
{
  /** Specifies the prescaler value used to divide the timer kernel clock. \n
      This parameter can be a number between Min_Data = 0x0000
      and Max_Data = 0xFFFF. */
  uint32_t prescaler;

  /** Specifies the counter mode */
  hal_tim_counter_mode_t counter_mode;

  /** Specifies the period value to be loaded into the active
      Auto-Reload Register. \n
      For a counter with a 16-bit resolution, this parameter can be a number
      between Min_Data = 0x0001 and Max_Data = 0xFFFF (or 0xFFFEF if dithering
      is activated). In non-dithering mode, only bits 15:0 hold the period
      value. In dithering mode, the integer part of the period is in bits 19:4
      and bits 3:0 hold the dithering part. \n
      For a counter with a 32-bit resolution, this parameter can be a number
      between Min_Data = 0x00000001 and Max_Data = 0xFFFFFFFF (or 0xFFFFFFEF if
      dithering is activated). The register holds the period value in
      non-dithering mode. In dithering mode, the integer part is in ARR[31:4] and
      ARR[3:0] bitfield contains the dithered part. */
  uint32_t period;

  /** Specifies the repetition counter value for instances that support it. \n
      If the repetition counter is used, the update event (UEV) is generated
      after upcounting repeats the number of times programmed in the
      repetition counter register (RCR). \n
      Otherwise, the update event is generated at each counter overflow.
      The value is encoded on 8 or 16 bits depending on the instance. */
  uint32_t repetition_counter;

  /** TIM clock selection. \n
      Specifies the source of the clock feeding the timer's prescaler.
      Also specifies the trigger input to be used to synchronize the counter
      in case the clock source is external mode 1. */
  hal_tim_clock_sel_t clock_sel;

} hal_tim_config_t;


/**
  * @brief HAL TIM Output Channel Configuration Structure definition.
  */
typedef struct
{
  /** Specifies the output channel mode */
  hal_tim_oc_mode_t mode;

  /** Specifies the pulse value to be loaded into the Capture/Compare Register. \n
      For a 16 bits counter,this parameter can be a number between
      Min_Data = 0x0000 and Max_Data = 0xFFFF (or 0xFFFEF if dithering is
      activated in which case bits[3:0] represent the dithered part and
      bits[19:4] the integer part).
      For a 32 bits counter,this parameter can be a number between
      Min_Data = 0x00000000 and Max_Data = 0xFFFFFFFF (or 0xFFFFFFEF if
      dithering is activated in which case bits[3:0] represent the dithered part
      and bits[31:4] the integer part). */
  uint32_t pulse;

} hal_tim_oc_compare_unit_config_t;


/**
  * @brief HAL TIM Output Channel Configuration Structure definition.
  */
typedef struct
{
  /** Specifies the output channel (CHx or CHxN) polarity */
  hal_tim_oc_polarity_t polarity;

  /** Specifies the output channel (CHx or CHxN) state during Idle state. \n
      This parameter is only valid for timer instances supporting break feature. */
  hal_tim_oc_idle_state_t idle_state;

  /** Specifies the output channel (CHx or CHxN) state when it is disabled. \n
      This parameter is only valid for timer instances supporting the break feature
      and is not applicable to internal channels. */
  hal_tim_oc_override_state_t override_state;

  /** Specifies the output channel (CHx or CHxN) break mode. \n
      This parameter is only valid for timer instances supporting the break feature
      and is not applicable to internal channels. */
  hal_tim_oc_break_mode_t break_mode;

} hal_tim_oc_channel_config_t;


/**
  * @brief HAL TIM Input Channel Configuration Structure definition.
  */
typedef struct
{
  /** Specifies the input source                    */
  hal_tim_channel_src_t source;

  /** Specifies the active edge of the input signal */
  hal_tim_ic_polarity_t polarity;

  /** Specifies the input channel filter            */
  hal_tim_filter_t filter;

} hal_tim_ic_channel_config_t;

/**
  * @brief HAL TIM Input Channel Capture Configuration Structure definition.
  */
typedef struct
{

  /** Specifies the signal to capture          */
  hal_tim_ic_capture_unit_src_t source;

  /** Specifies the input capture prescaler    */
  hal_tim_ic_capture_unit_prescaler_t prescaler;

} hal_tim_ic_capture_unit_config_t;


/**
  * @brief  TIM Index configuration Structure definition.
  * @note   Index input (ETR input polarity, prescaler and filter)
  *         is configured separately
  */
typedef struct
{
  /** Specifies in which counter direction
      the index event resets the counter                    */
  hal_tim_encoder_index_dir_t dir;

