MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** Specifies in which AB input configuration
      the index event resets the counter                    */
  hal_tim_encoder_index_pos_sel_t pos;

  /** Specifies whether or not the index event
      is conditioned by TI3 or TI4 input                    */
  hal_tim_encoder_index_blank_mode_t blanking;

  /** Specifies whether index is always active or only once */
  hal_tim_encoder_index_sel_t idx;

} hal_tim_encoder_index_config_t;


/**
  * @brief  TIM ETR configuration Structure definition.
  */
typedef struct
{
  /** Specifies the external trigger input source                */
  hal_tim_ext_trig_src_t source;

  /** Specifies the external trigger input polarity              */
  hal_tim_ext_trig_polarity_t polarity;

  /** Specifies the external trigger input filter                */
  hal_tim_filter_t filter;

  /** Specifies the external trigger input prescaler             */
  hal_tim_ext_trig_prescaler_t prescaler;

  /** Specifies the external trigger input synchronous prescaler */
  hal_tim_ext_trig_sync_prescaler_t sync_prescaler;

} hal_tim_ext_trig_config_t;


/**
  * @brief  TIM Slave mode controller configuration Structure definition.
  */
typedef struct
{
  /** Specifies the slave mode                          */
  hal_tim_slave_mode_t mode;

  /** Specifies the slave mode controller trigger input */
  hal_tim_trig_sel_t trigger;

} hal_tim_slave_config_t;


/**
  * @brief TIM Trigger Output 2 configuration Structure definition.
  */
typedef struct
{
  /** Specifies the trigger-output2 source                                */
  hal_tim_trigger_output2_source_t trgo2_src;

  /** Specifies the trigger-output2 postscaler. \n
      The number of events on tim_trgo2 is divided by (TGO2PSC[4:0] + 1). */
  uint32_t postscaler;

} hal_tim_trigger_output2_config_t;


#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief TIM DMA Burst operation specification Structure definition.
  */
typedef struct
{
  /** Specifies the DMA burst base address */
  hal_tim_dmaburst_base_addr_reg_t address;

  /** Specifies the DMA burst source       */
  hal_tim_dmaburst_source_t source;

  /** Specifies the DMA burst length       */
  hal_tim_dmaburst_length_t length;

} hal_tim_dmaburst_config_t;
#endif /* USE_HAL_TIM_DMA */


/**
  * @brief  TIM Break input(s) configuration Structure definition.
  * @note   2 break inputs can be configured (BKIN and BKIN2) with
  *         configurable filter, polarity and mode (input or bidirectional).
  */
typedef struct
{
  /** Specifies the break input polarity                        */
  hal_tim_break_input_polarity_t polarity;

  /** Specifies the break input filter                          */
  hal_tim_filter_t filter;

  /** Specifies whether the break input is bidirectional or not.
      (only for instances that support it)                       */
  hal_tim_break_input_mode_t mode;

} hal_tim_break_input_config_t;


/**
  * @brief Off-state configuration for RUN and IDLE modes.
  */
typedef struct
{
  /** Specifies the state of the output channel
      when the main output is enabled          */
  hal_tim_off_state_run_t off_state_run;

  /** Specifies the state of the output channel
      when the main output is disabled         */
  hal_tim_off_state_idle_t off_state_idle;

} hal_tim_off_states_config_t;


/**
  * @brief HAL TIM Pulse Generator Configuration Structure definition.
  */
typedef struct
{
  /** Specifies the pulse width prescaler                  */
  hal_tim_pulse_prescaler_t prescaler;

  /** Specifies the pulse width.
      This parameter can be a number between 0x00 and 0xFF */
  uint32_t pulse_width;

} hal_tim_pulse_generator_config_t;


/**
  * @brief HAL TIM Time Base Handle type definition.
  */

typedef struct hal_tim_handle_s hal_tim_handle_t;

/*
 * Types definitions for the callbacks
 */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
/** HAL TIM generic callback pointer definition */
typedef void (* hal_tim_cb_t)(hal_tim_handle_t *);
/** HAL TIM callback pointer definition with channel parameter */
typedef void (* hal_tim_channel_cb_t)(hal_tim_handle_t *, hal_tim_channel_t);
/** HAL TIM callback pointer definition with break input parameter */
typedef void (* hal_tim_break_cb_t)(hal_tim_handle_t *, hal_tim_break_input_id_t);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */

/**
  * @brief HAL TIM Time Base Handle Structure definition.
  */
struct hal_tim_handle_s
{
  /** HAL TIM instance */
  hal_tim_t instance;

  /** TIM global state */
  volatile hal_tim_state_t global_state;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /** DMA Handlers array. (@ref hal_tim_dma_index_t) */
  hal_dma_handle_t *hdma[HAL_TIM_DMA_REQUESTS];

  /** DMA Burst source */
  volatile tim_dmaburst_source_t dmaburst_source;
#endif /* USE_HAL_TIM_DMA */

  /** TIM channels state array */
  volatile hal_tim_channel_state_t channel_states[HAL_TIM_CHANNELS];

#if defined(USE_HAL_TIM_USER_DATA) && (USE_HAL_TIM_USER_DATA == 1)
  /** User Data Pointer  */
  const void *p_user_data;
#endif /* USE_HAL_TIM_USER_DATA */

#if defined (USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)
  /** Store last error code */
  volatile uint32_t last_error_codes;
#endif /* USE_HAL_TIM_GET_LAST_ERRORS */

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /** TIM Error callback */
  hal_tim_cb_t error_callback;

  /** TIM Update DMA stop callback */
  hal_tim_cb_t stop_callback;

  /** TIM capture/Compare DMA stop callback */
  hal_tim_channel_cb_t channel_stop_callback;
#endif /* USE_HAL_TIM_DMA */

  /** TIM Update callback */
  hal_tim_cb_t update_callback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /** TIM Update Half Complete callback */
  hal_tim_cb_t update_half_cplt_callback;
#endif /* USE_HAL_TIM_DMA */

  /** TIM Trigger callback */
  hal_tim_cb_t trigger_callback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /** TIM Trigger Half Complete callback */
  hal_tim_cb_t trigger_half_cplt_callback;
#endif /* USE_HAL_TIM_DMA */

