MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  /** TIM Input Capture callback */
  hal_tim_channel_cb_t input_capture_callback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /** TIM Input Capture Half Complete callback */
  hal_tim_channel_cb_t input_capture_half_cplt_callback;
#endif /* USE_HAL_TIM_DMA */

  /** TIM Compare Match callback */
  hal_tim_channel_cb_t compare_match_callback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /** TIM Compare Match Half Complete callback */
  hal_tim_channel_cb_t compare_match_half_cplt_callback;
#endif /* USE_HAL_TIM_DMA */

  /** TIM Commutation callback */
  hal_tim_cb_t commutation_callback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /** TIM Commutation Half Complete callback */
  hal_tim_cb_t commutation_half_cplt_callback;
#endif /* USE_HAL_TIM_DMA */

  /** TIM Break callback */
  hal_tim_cb_t break_callback;

  /** TIM Break2 callback */
  hal_tim_cb_t break2_callback;

  /** TIM System Break callback */
  hal_tim_cb_t system_break_callback;

  /** TIM Software Break callback */
  hal_tim_break_cb_t software_break_callback;

  /** TIM Encoder Index callback */
  hal_tim_cb_t encoder_index_callback;

  /** TIM Direction Change callback */
  hal_tim_cb_t direction_change_callback;

  /** TIM Index Error callback */
  hal_tim_cb_t index_error_callback;

  /** TIM Transition Error callback */
  hal_tim_cb_t transition_error_callback;

#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
};


/**
  * @}
  */
/* End of exported types ---------------------------------------------------------------------------------------------*/


/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_Exported_Functions HAL TIM Functions
  * @{
  */


/** @defgroup TIM_Exported_Functions_Group1 Timer Initialization/Deinitialization function
  * @{
  */
hal_status_t HAL_TIM_Init(hal_tim_handle_t *htim, hal_tim_t instance);
void HAL_TIM_DeInit(hal_tim_handle_t *htim);
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_SetDMA(hal_tim_handle_t *htim,
                            hal_tim_dma_index_t dma_idx,
                            hal_dma_handle_t *hdma);
#endif /* USE_HAL_TIM_DMA */
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group2 Timer Peripheral State, Error functions, Kernel Clock Frequency.
  *           This group gathers the functions for state, error and kernel clock management.
  * @{
  */
hal_tim_state_t HAL_TIM_GetState(const hal_tim_handle_t *htim);

hal_tim_channel_state_t HAL_TIM_GetChannelState(const hal_tim_handle_t *htim,
                                                hal_tim_channel_t channel);

#if defined (USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)

uint32_t HAL_TIM_GetLastErrorCodes(const hal_tim_handle_t *htim);

#endif /* USE_HAL_TIM_GET_LAST_ERRORS */

uint32_t HAL_TIM_GetClockFreq(const hal_tim_handle_t *htim);
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group3 Timer Timebase configuration and control
  *            This group contains the functions used to configure and control the
  *            time base unit.
  *
  *            The configuration includes:
  *             - Clock source selection
  *               - internal
  *               - external mode 1
  *               - external mode 2
  *               - encoder mode
  *             - Autoreload setting
  *             - Prescaler setting
  *             - Repetition counter setting
  *             - Dithering management
  *
  *            Control functions start or stop the timer's counter. \n
  *            Three execution modes are proposed:
  *             - polling: \n
  *               Neither update interrupt nor update DMA request are enabled. \n
  *               It is up to the application to read/clear the update flag if
  *               needed.
  *             - interrupt mode: \n
  *               Update interrupt is enabled.
  *             - DMA mode (commutation disabled): \n
  *               A DMA transfer is started in interrupt mode and Update DMA request
  *               is enabled. \n
  *               At every update event, the DMA transfers one word from the memory
  *               to the autoreload register.
  *
  *            @note
  *             - When the slave mode controller is configured in trigger mode
  *               the timer's counter isn't started by the software.
  *               (the timer's counter starts in response to an event on a selected trigger input)
  *
  *             - When commutation is enabled
  *                  - interrupt mode: \n
  *                    Commutation interrupt is enabled
  *                  - DMA mode: \n
  *                    Commutation DMA request is enabled. \n
  *                    At every commutation event, the DMA transfer takes place as
  *                    per DMA transfer configuration. \n
  *                    Note that in that case the start of the DMA transfer is under
  *                    application's responsibility. \n
  *
  *             - When the slave node is enabled
  *                  - interrupt mode: \n
  *                    Trigger interrupt is enabled. \n
  *
  * @{
  */
hal_status_t HAL_TIM_SetConfig(hal_tim_handle_t *htim,
                               const hal_tim_config_t *p_config);
void HAL_TIM_GetConfig(const hal_tim_handle_t *htim,
                       hal_tim_config_t *p_config);

hal_status_t HAL_TIM_SetPeriod(hal_tim_handle_t *htim,
                               uint32_t period);
uint32_t HAL_TIM_GetPeriod(const hal_tim_handle_t *htim);

hal_status_t
HAL_TIM_SetDitheredPeriod(hal_tim_handle_t *htim,
                          uint32_t period,
                          hal_tim_dithering_pattern_t period_dithering_pattern);
void HAL_TIM_GetDitheredPeriod(const hal_tim_handle_t *htim,
                               uint32_t *p_period,
                               hal_tim_dithering_pattern_t *p_period_dithering_pattern);

hal_status_t HAL_TIM_SetPrescaler(hal_tim_handle_t *htim,
                                  uint32_t prescaler);
uint32_t HAL_TIM_GetPrescaler(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_SetCounterMode(hal_tim_handle_t *htim,
                                    hal_tim_counter_mode_t counter_mode);
hal_tim_counter_mode_t HAL_TIM_GetCounterMode(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_SetDTSPrescaler(hal_tim_handle_t *htim,
                                     hal_tim_dts_prescaler_t dts_prescaler);
hal_tim_dts_prescaler_t HAL_TIM_GetDTSPrescaler(const hal_tim_handle_t *htim);

