MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
hal_status_t HAL_TIM_SetDTS2Prescaler(hal_tim_handle_t *htim,
                                      hal_tim_dts2_prescaler_t dts2_prescaler);
hal_tim_dts2_prescaler_t HAL_TIM_GetDTS2Prescaler(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_SetRepetitionCounter(hal_tim_handle_t *htim,
                                          uint32_t repetition_counter);
uint32_t HAL_TIM_GetRepetitionCounter(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_SetClockSource(hal_tim_handle_t *htim,
                                    const hal_tim_clock_sel_t *p_clk_sel);
void HAL_TIM_GetClockSource(const hal_tim_handle_t *htim,
                            hal_tim_clock_sel_t *p_clk_sel);

hal_status_t HAL_TIM_SetCounter(hal_tim_handle_t *htim, uint32_t counter_value);

uint32_t HAL_TIM_GetCounter(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_EnableUpdateGeneration(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableUpdateGeneration(hal_tim_handle_t *htim);
hal_tim_update_generation_status_t HAL_TIM_IsEnabledUpdateGeneration(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_SetUpdateSource(hal_tim_handle_t *htim,
                                     hal_tim_update_src_t update_source);
hal_tim_update_src_t HAL_TIM_GetUpdateSource(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_EnableUpdateFlagRemap(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableUpdateFlagRemap(hal_tim_handle_t *htim);
hal_tim_update_flag_remap_status_t HAL_TIM_IsEnabledUpdateFlagRemap(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_EnableAutoReloadPreload(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableAutoReloadPreload(hal_tim_handle_t *htim);
hal_tim_auto_reload_preload_status_t HAL_TIM_IsEnabledAutoReloadPreload(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_EnableDithering(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableDithering(hal_tim_handle_t *htim);
hal_tim_dithering_status_t HAL_TIM_IsEnabledDithering(const hal_tim_handle_t *htim);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_SetCaptureCompareDMAReqSource(hal_tim_handle_t *htim,
                                                   hal_tim_cc_dmareq_src_t cc_dmareq_source);
hal_tim_cc_dmareq_src_t HAL_TIM_GetCaptureCompareDMAReqSource(const hal_tim_handle_t *htim);
#endif /* USE_HAL_TIM_DMA */

hal_status_t HAL_TIM_Start(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_Stop(hal_tim_handle_t *htim);

hal_status_t HAL_TIM_Start_IT(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_Start_IT_Opt(hal_tim_handle_t *htim, uint32_t interrupts);
hal_status_t HAL_TIM_Stop_IT(hal_tim_handle_t *htim);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_Start_DMA(hal_tim_handle_t *htim,
                               const uint8_t *p_data,
                               uint32_t size_byte);
hal_status_t HAL_TIM_Start_DMA_Opt(hal_tim_handle_t *htim,
                                   const uint8_t *p_data,
                                   uint32_t size_byte,
                                   uint32_t interrupts);
hal_status_t HAL_TIM_Stop_DMA(hal_tim_handle_t *htim);
#endif /* USE_HAL_TIM_DMA */
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group4 Timer Output Channel functions
  *            This group contains the functions used to configure and control
  *            the output stage of the timer's capture/compare channels.
  *
  *            The output stage of a timer can be used to
  *             - control an output waveform
  *             - generate complementary PWM signals with deadtime insertion
  *             - indicate when a period has elapsed
  *
  *            The configuration of an output channel includes:
  *             - selection of the output mode (e.g. output compare, PWM, ...)
  *             - selection of the channel polarity
  *             - setting of the compare value
  *
  *            Control functions enable or disable the timer's output channel. \n
  *            Three execution modes are available:
  *             - polling \n
  *               Neither compare match interrupt nor compare match DMA request
  *               are enabled. \n
  *               Read/clear the compare match flag if needed.
  *             - interrupt mode \n
  *               Compare match interrupt is enabled for the concerned channel.
  *             - DMA \n
  *               A DMA transfer is started in interrupt mode and compare match
  *               DMA request is enabled. \n
  *               At every compare match event, the DMA transfers one word from
  *               the memory to the capture/compare register.
  *
  *
  * @{
  */
hal_status_t HAL_TIM_OC_SetConfigCompareUnit(hal_tim_handle_t *htim,
                                             hal_tim_oc_compare_unit_t compare_unit,
                                             const hal_tim_oc_compare_unit_config_t *p_config);
void HAL_TIM_OC_GetConfigCompareUnit(const hal_tim_handle_t *htim,
                                     hal_tim_oc_compare_unit_t compare_unit,
                                     hal_tim_oc_compare_unit_config_t *p_config);

hal_status_t HAL_TIM_OC_SetCompareUnitPulse(hal_tim_handle_t *htim,
                                            hal_tim_oc_compare_unit_t compare_unit,
                                            uint32_t pulse);
uint32_t HAL_TIM_OC_GetCompareUnitPulse(const hal_tim_handle_t *htim,
                                        hal_tim_oc_compare_unit_t compare_unit);

hal_status_t HAL_TIM_OC_SetCompareUnitDitheredPulse(hal_tim_handle_t *htim,
                                                    hal_tim_oc_compare_unit_t compare_unit,
                                                    uint32_t pulse,
                                                    hal_tim_dithering_pattern_t pulse_dithering_pattern);
void HAL_TIM_OC_GetCompareUnitDitheredPulse(const hal_tim_handle_t *htim,
                                            hal_tim_oc_compare_unit_t compare_unit,
                                            uint32_t *p_pulse,
                                            hal_tim_dithering_pattern_t *p_pulse_dithering_pattern);

hal_status_t HAL_TIM_OC_EnableComparePreload(hal_tim_handle_t *htim,
                                             hal_tim_oc_compare_unit_t compare_unit);
hal_status_t HAL_TIM_OC_DisableComparePreload(hal_tim_handle_t *htim,
                                              hal_tim_oc_compare_unit_t compare_unit);
hal_tim_oc_compare_preload_status_t HAL_TIM_OC_IsEnabledComparePreload(const hal_tim_handle_t *htim,
                                                                       hal_tim_oc_compare_unit_t compare_unit);

hal_status_t HAL_TIM_OC_EnableCompareFastMode(hal_tim_handle_t *htim,
                                              hal_tim_oc_compare_unit_t compare_unit);
hal_status_t HAL_TIM_OC_DisableCompareFastMode(hal_tim_handle_t *htim,
                                               hal_tim_oc_compare_unit_t compare_unit);
hal_tim_oc_compare_fast_mode_status_t HAL_TIM_OC_IsEnabledCompareFastMode(const hal_tim_handle_t *htim,
                                                                          hal_tim_oc_compare_unit_t compare_unit);

hal_status_t HAL_TIM_OC_SetConfigChannel(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         const hal_tim_oc_channel_config_t *p_config);
void HAL_TIM_OC_GetConfigChannel(const hal_tim_handle_t *htim,
                                 hal_tim_channel_t channel,
                                 hal_tim_oc_channel_config_t *p_config);

hal_status_t HAL_TIM_OC_EnableOutputOverride(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_OC_DisableOutputOverride(hal_tim_handle_t *htim);
hal_tim_oc_output_override_status_t HAL_TIM_OC_IsEnabledOutputOverride(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_OC_SetPulseGenerator(hal_tim_handle_t *htim,
                                          const hal_tim_pulse_generator_config_t *p_config);
void HAL_TIM_OC_GetPulseGenerator(const hal_tim_handle_t *htim,
                                  hal_tim_pulse_generator_config_t *p_config);

