MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
hal_status_t HAL_TIM_OC_SetGroupChannel(hal_tim_handle_t *htim,
                                        uint32_t group);
uint32_t HAL_TIM_OC_GetGroupChannel(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_OC_StartChannel(hal_tim_handle_t *htim,
                                     hal_tim_channel_t channel);
hal_status_t HAL_TIM_OC_StopChannel(hal_tim_handle_t *htim,
                                    hal_tim_channel_t channel);

hal_status_t HAL_TIM_OC_StartChannel_IT(hal_tim_handle_t *htim,
                                        hal_tim_channel_t channel);
hal_status_t HAL_TIM_OC_StopChannel_IT(hal_tim_handle_t *htim,
                                       hal_tim_channel_t channel);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_OC_StartChannel_DMA(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         const uint8_t *p_data,
                                         uint32_t size_byte);
hal_status_t HAL_TIM_OC_StartChannel_DMA_Opt(hal_tim_handle_t *htim,
                                             hal_tim_channel_t channel,
                                             const uint8_t *p_data,
                                             uint32_t size_byte,
                                             uint32_t interrupts);
hal_status_t HAL_TIM_OC_StopChannel_DMA(hal_tim_handle_t *htim,
                                        hal_tim_channel_t channel);
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  Helper function to get a compare unit from an output channel.
  * @param  channel  Output channel. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  *                  @arg @ref HAL_TIM_CHANNEL_5
  *                  @arg @ref HAL_TIM_CHANNEL_6
  *                  @arg @ref HAL_TIM_CHANNEL_7
  *                  @arg @ref HAL_TIM_CHANNEL_1N
  *                  @arg @ref HAL_TIM_CHANNEL_2N
  *                  @arg @ref HAL_TIM_CHANNEL_3N
  *                  @arg @ref HAL_TIM_CHANNEL_4N
  * @retval hal_tim_oc_compare_unit_t  Compare unit corresponding to the
  *         output channel.
  */
__STATIC_INLINE hal_tim_oc_compare_unit_t
hal_tim_oc_channel_to_compare_unit(hal_tim_channel_t channel)
{
  const hal_tim_oc_compare_unit_t ch_to_cmp_unit[] =
  {
    HAL_TIM_OC_COMPARE_UNIT_1,  /* HAL_TIM_CHANNEL_1  */
    HAL_TIM_OC_COMPARE_UNIT_2,  /* HAL_TIM_CHANNEL_2  */
    HAL_TIM_OC_COMPARE_UNIT_3,  /* HAL_TIM_CHANNEL_3  */
    HAL_TIM_OC_COMPARE_UNIT_4,  /* HAL_TIM_CHANNEL_4  */
    HAL_TIM_OC_COMPARE_UNIT_5,  /* HAL_TIM_CHANNEL_5  */
    HAL_TIM_OC_COMPARE_UNIT_6,  /* HAL_TIM_CHANNEL_6  */
    HAL_TIM_OC_COMPARE_UNIT_7,  /* HAL_TIM_CHANNEL_7  */
    HAL_TIM_OC_COMPARE_UNIT_1,  /* HAL_TIM_CHANNEL_1N */
    HAL_TIM_OC_COMPARE_UNIT_2,  /* HAL_TIM_CHANNEL_2N */
    HAL_TIM_OC_COMPARE_UNIT_3,  /* HAL_TIM_CHANNEL_3N */
    HAL_TIM_OC_COMPARE_UNIT_4,  /* HAL_TIM_CHANNEL_4N */
  };

  return ch_to_cmp_unit[channel];
}

/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group5 Timer Input Channel functions
  *            This group contains the functions used to configure and control
  *            the input stage of the timer's capture/compare channels.
  *
  *            The input stage of a timer can be used to
  *             - inject an external clock
  *             - detect a trigger
  *             - measure the period and duty cycle of a PWM signal
  *             - interface with an incremental (quadrature) decoder
  *             - interface with a hall sensor
  *
  *            The configuration of an input stage includes:
  *             - selection of a channel input source
  *             - selection of the input polarity
  *             - selection of the filter
  *             - configuration of the capture unit
  *               - input capture source selection
  *               - capture prescaler
  *
  *            The configuration of the XOR gate (if available) includes:
  *             - position (global)
  *             - per-input inversion (typically TI1, TI2 and TI3)
  *             - enable/disable
  *
  *            Control functions enable or disable the timer's input channel. \n
  *            Three execution modes are proposed:
  *             - polling \n
  *               Neither capture interrupt nor capture DMA request are enabled. \n
  *               It is up to the application to read/clear the capture flag if
  *               needed.
  *             - interrupt mode \n
  *               Capture interrupt is enabled for the concerned channel.
  *             - DMA \n
  *               A DMA transfer is started in interrupt mode and capture DMA
  *               request is enabled. \n
  *               At every capture event, the DMA transfers one word from the
  *               capture/compare register to the memory.
  *
  *
  * @{
  */
hal_status_t HAL_TIM_IC_SetConfigChannel(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         const hal_tim_ic_channel_config_t *p_config);
void HAL_TIM_IC_GetConfigChannel(const hal_tim_handle_t *htim,
                                 hal_tim_channel_t channel,
                                 hal_tim_ic_channel_config_t *p_config);

hal_status_t HAL_TIM_IC_SetChannelSource(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         hal_tim_channel_src_t channel_src);
hal_tim_channel_src_t HAL_TIM_IC_GetChannelSource(const hal_tim_handle_t *htim,
                                                  hal_tim_channel_t channel);

hal_status_t HAL_TIM_IC_SetConfigCaptureUnit(hal_tim_handle_t *htim,
                                             hal_tim_ic_capture_unit_t capture_unit,
                                             const hal_tim_ic_capture_unit_config_t *p_config);
void HAL_TIM_IC_GetConfigCaptureUnit(const hal_tim_handle_t *htim,
                                     hal_tim_ic_capture_unit_t capture_unit,
                                     hal_tim_ic_capture_unit_config_t *p_config);

