MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
hal_status_t HAL_TIM_IC_SetXORGatePosition(hal_tim_handle_t *htim,
                                           hal_tim_ic_xor_gate_position_t xor_position);
hal_tim_ic_xor_gate_position_t HAL_TIM_IC_GetXORGatePosition(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_IC_EnableXORGateInputInversion(hal_tim_handle_t *htim, hal_tim_channel_t channel);
hal_status_t HAL_TIM_IC_DisableXORGateInputInversion(hal_tim_handle_t *htim, hal_tim_channel_t channel);
hal_tim_ic_xor_gate_input_inversion_status_t HAL_TIM_IC_IsEnabledXORGateInputInversion(const hal_tim_handle_t *htim,
    hal_tim_channel_t channel);

hal_status_t HAL_TIM_IC_EnableXORGate(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_IC_DisableXORGate(hal_tim_handle_t *htim);
hal_tim_ic_xor_gate_status_t HAL_TIM_IC_IsEnabledXORGate(const hal_tim_handle_t *htim);

uint32_t HAL_TIM_IC_ReadChannelCapturedValue(const hal_tim_handle_t *htim,
                                             hal_tim_channel_t channel);

hal_tim_ic_channel_level_t HAL_TIM_IC_GetChannelLevel(const hal_tim_handle_t *htim,
                                                      hal_tim_channel_t channel);

hal_status_t HAL_TIM_IC_StartChannel(hal_tim_handle_t *htim,
                                     hal_tim_channel_t channel);
hal_status_t HAL_TIM_IC_StopChannel(hal_tim_handle_t *htim,
                                    hal_tim_channel_t channel);

hal_status_t HAL_TIM_IC_StartChannel_IT(hal_tim_handle_t *htim,
                                        hal_tim_channel_t channel);
hal_status_t HAL_TIM_IC_StopChannel_IT(hal_tim_handle_t *htim,
                                       hal_tim_channel_t channel);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_IC_StartChannel_DMA(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         uint8_t *p_data,
                                         uint32_t size_byte);
hal_status_t HAL_TIM_IC_StartChannel_DMA_Opt(hal_tim_handle_t *htim,
                                             hal_tim_channel_t channel,
                                             uint8_t *p_data,
                                             uint32_t size_byte,
                                             uint32_t interrupts);
hal_status_t HAL_TIM_IC_StopChannel_DMA(hal_tim_handle_t *htim,
                                        hal_tim_channel_t channel);
#endif /* USE_HAL_TIM_DMA */


/**
  * @brief  Helper function to get a direct capture unit from an input channel.
  * @param  channel  Input channel. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  *
  * @retval hal_tim_ic_capture_unit_t  Capture unit corresponding to the
  *         input channel.
  */
__STATIC_INLINE hal_tim_ic_capture_unit_t
hal_tim_ic_channel_to_direct_capture_unit(hal_tim_channel_t channel)
{
  const hal_tim_ic_capture_unit_t ch_to_dir_capt_unit[] =
  {
    HAL_TIM_IC_CAPTURE_UNIT_1,  /* HAL_TIM_CHANNEL_1  */
    HAL_TIM_IC_CAPTURE_UNIT_2,  /* HAL_TIM_CHANNEL_2  */
    HAL_TIM_IC_CAPTURE_UNIT_3,  /* HAL_TIM_CHANNEL_3  */
    HAL_TIM_IC_CAPTURE_UNIT_4,  /* HAL_TIM_CHANNEL_4  */
  };

  return ch_to_dir_capt_unit[channel];
}

/**
  * @brief  Helper function to get an indirect capture unit from an input channel.
  * @param  channel  Input channel. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  *
  * @retval hal_tim_ic_capture_unit_t  Indirect capture unit corresponding to the
  *         input channel.
  */
__STATIC_INLINE hal_tim_ic_capture_unit_t
hal_tim_ic_channel_to_indirect_capture_unit(hal_tim_channel_t channel)
{
  const hal_tim_ic_capture_unit_t ch_to_ind_capt_unit[] =
  {
    HAL_TIM_IC_CAPTURE_UNIT_2,  /* HAL_TIM_CHANNEL_1  */
    HAL_TIM_IC_CAPTURE_UNIT_1,  /* HAL_TIM_CHANNEL_2  */
    HAL_TIM_IC_CAPTURE_UNIT_4,  /* HAL_TIM_CHANNEL_3  */
    HAL_TIM_IC_CAPTURE_UNIT_3,  /* HAL_TIM_CHANNEL_4  */
  };

  return ch_to_ind_capt_unit[channel];
}

/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group6 Timer One-Pulse functions
  * @{
  *            Functions in this group form the API for the control
  *            of the one-pulse mode (single pulse or repetitive).
  *
  *            The one-pulse mode of a timer can be used to generate a pulse
  *            with a programmable length after a programmable delay on trigger
  *            detection \n(hence, an input channel and an output channel have to
  *            be configured.)
  *
  *            The control functions to enable/disable the one-pulse mode.
  *
  *
  */
hal_status_t HAL_TIM_EnableOnePulseMode(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableOnePulseMode(hal_tim_handle_t *htim);
hal_tim_one_pulse_mode_status_t HAL_TIM_IsEnabledOnePulseMode(const hal_tim_handle_t *htim);
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group7 Timer Encoder Index functions
  * @{
  *            Functions in this group form the API for the configuration
  *            and control of the encoder index.
  *
  *            Basically, the timer is used to determine a rotor speed/position
  *            when a quadrature encoder, connected to the timer's input channels 1
  *            and 2, is used as an external clock. \n
  *            The counter can be reset by an index signal coming from the encoder
  *            connected to the timer external trigger input (ETR).
  *
  *            The configuration of the encoder index:
  *             - specifies in which counter direction the index event resets the counter
  *             - specifies in which AB input configuration the index event resets the counter
  *               - gated with A and B (i.e. channel 1 and 2)
  *               - gated with A (or with B)
  *               - ungated
  *             - index blanking (the Index event can be blanked using TI3 or TI4 input) \n
  *               During the blanking window, the index events are no longer resetting the counter)
  *             - specifies if this index is active only the first time or always
  *
  *            The control functions to enable/disable the encoder index.
  *
  */
hal_status_t HAL_TIM_SetConfigEncoderIndex(hal_tim_handle_t *htim,
                                           const hal_tim_encoder_index_config_t *p_config);
void HAL_TIM_GetConfigEncoderIndex(const hal_tim_handle_t *htim,
                                   hal_tim_encoder_index_config_t *p_config);

hal_status_t HAL_TIM_EnableEncoderIndex(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableEncoderIndex(hal_tim_handle_t *htim);
hal_tim_encoder_index_status_t HAL_TIM_IsEnabledEncoderIndex(const hal_tim_handle_t *htim);

/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group8 Timer External Trigger configuration
  * @{
  *            Functions in this group can be used to configure the external trigger input.
  *
  *            The configuration of the external trigger (ETR) input implies:
  *             -  selection the input source for the ETR
  *             -  selection the input polarity
  *             -  setting of the prescaler
  *             -  setting of the filter
  *
  *
  */
hal_status_t HAL_TIM_SetExternalTriggerInput(hal_tim_handle_t *htim,
                                             const hal_tim_ext_trig_config_t *p_config);
void HAL_TIM_GetExternalTriggerInput(const hal_tim_handle_t *htim,
                                     hal_tim_ext_trig_config_t *p_config);
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group9 Timer Master/Slave functions
  * @{
  *            Functions in this group form the API for the configuration
  *            and control of a timer in master or/and slave mode
  *            (a timer instance can act as both a master and a slave).
  *
  *            This interface is typically used when one wants to cascade timer
  *            instances or to synchronize a timer with the DAC or the ADC.
  *
  *            The slave configuration sets:
  *             - the slave mode
  *             - the trigger input to be used to synchronize the counter
  *
  *            The master configuration sets:
  *             - the trigger output (TRGO and if supported TRGO2)
  *
  *            The control enables/disables:
  *             - the master/slave mode \n
  *               When enabled, the effect of an event on the trigger input (trgi)
  *               is delayed to allow a perfect synchronization between the
  *               current timer and its slaves (through trgo). \n It is useful if
  *               we want to synchronize several timers on a single external event.
  *             - the slave mode preload \n
  *               When enabled, the transfer from SMS[3:0] preload to active
  *               value is triggered either by the timer's Update event or
  *               Index event.
  *
  *
  */
hal_status_t HAL_TIM_SetSynchroSlave(hal_tim_handle_t *htim,
                                     const hal_tim_slave_config_t *p_config);
void HAL_TIM_GetSynchroSlave(const hal_tim_handle_t *htim,
                             hal_tim_slave_config_t *p_config);

hal_status_t HAL_TIM_SetTriggerOutput(hal_tim_handle_t *htim,
                                      hal_tim_trigger_output_source_t trgo_src);
hal_tim_trigger_output_source_t
HAL_TIM_GetTriggerOutput(const hal_tim_handle_t *htim);

