MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
hal_status_t HAL_TIM_SetConfigTriggerOutput2(hal_tim_handle_t *htim,
                                             hal_tim_trigger_output2_config_t *p_config);
void HAL_TIM_GetConfigTriggerOutput2(const hal_tim_handle_t *htim,
                                     hal_tim_trigger_output2_config_t *p_config);

hal_status_t HAL_TIM_SetTriggerOutput2(hal_tim_handle_t *htim,
                                       hal_tim_trigger_output2_source_t trgo2_src);
hal_tim_trigger_output2_source_t
HAL_TIM_GetTriggerOutput2(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_SetTriggerOutput2Postscaler(hal_tim_handle_t *htim,
                                                 uint32_t postscaler);
uint32_t HAL_TIM_GetTriggerOutput2Postscaler(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_EnableSlaveModePreload(hal_tim_handle_t *htim,
                                            const hal_tim_slave_mode_preload_src_t preload_src);
hal_status_t HAL_TIM_DisableSlaveModePreload(hal_tim_handle_t *htim);
hal_tim_slave_mode_preload_status_t HAL_TIM_IsEnabledSlaveModePreload(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_EnableMasterSlaveMode(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableMasterSlaveMode(hal_tim_handle_t *htim);
hal_tim_master_slave_mode_status_t HAL_TIM_IsEnabledMasterSlaveMode(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_EnableADCSynchronization(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableADCSynchronization(hal_tim_handle_t *htim);
hal_tim_adc_synchronization_status_t HAL_TIM_IsEnabledADCSynchronization(const hal_tim_handle_t *htim);
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group10 Timer OCRef Clear functions
  * @{
  *            Functions in this group configure and control a timer's feature
  *            known as "OCRef Clear". \n
  *            This feature is used to force output compare signals to active
  *            or inactive level independently of any comparison between the
  *            output compare register and the counter. \n
  *            The source of the OCRef clear can be external trigger
  *            or an internal signal (e.g. comparator output).
  *            The configuration consist of:
  *             - selection of the source:
  *               - external (ETR)
  *               - internal (COMP1 or COMP2)
  *            The control enables/disables the "clear" function for a given
  *            channel.
  *
  */
hal_status_t HAL_TIM_SetOCRefClearSource(hal_tim_handle_t *htim,
                                         hal_tim_ocref_clr_src_t source);
hal_tim_ocref_clr_src_t HAL_TIM_GetOCRefClearSource(const hal_tim_handle_t *htim);


hal_status_t HAL_TIM_EnableCompareUnitOCRefClear(hal_tim_handle_t *htim,
                                                 hal_tim_oc_compare_unit_t compare_unit);
hal_status_t HAL_TIM_DisableCompareUnitOCRefClear(hal_tim_handle_t *htim,
                                                  hal_tim_oc_compare_unit_t compare_unit);
hal_tim_ocref_clr_status_t HAL_TIM_IsEnabledCompareUnitOCRefClear(const hal_tim_handle_t *htim,
                                                                  hal_tim_oc_compare_unit_t compare_unit);
/**
  *  @}
  */

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/** @defgroup TIM_Exported_Functions_Group11 Timer DMA Burst functions
  * @{
  *            Functions in this group configure and control a timer's feature
  *            known as "DMA burst".
  *
  *            The two main usages of this feature are:
  *            - DMA burst write:
  *              re-program part of the timer peripheral each time a given
  *              timer's event is triggered (e.g. modification on the fly of an
  *              output waveform).
  *            - DMA burts read:
  *              read several registers in a row, at regular intervals.
  *
  *            When a DMA burst operation is configured, the application must
  *            provide the DMA burst configuration which consist of:
  *            - Selection of the DMA burst start address
  *            - Length of the DMA burst
  *            - Selection of the DMA burst source (triggering event )
  *
  *            When a DMA burst operation is started, the application must
  *            provide:
  *            - Direction of the DMA burst (read or write)
  *            - Pointer to the data buffer
  *            - Size (in bytes) of the DMA transfer
  *
  *            The control consist of starting/stopping a DMA burst read/write.
  *
  */
hal_status_t HAL_TIM_SetConfigDMABurst(hal_tim_handle_t *htim,
                                       hal_tim_dmaburst_config_t *p_config);
void HAL_TIM_GetConfigDMABurst(const hal_tim_handle_t *htim,
                               hal_tim_dmaburst_config_t *p_config);

hal_status_t HAL_TIM_StartDMABurst(hal_tim_handle_t *htim,
                                   hal_tim_dmaburst_direction_t dmaburst_direction,
                                   const uint8_t *p_data,
                                   uint32_t size_byte);
hal_status_t HAL_TIM_StopDMABurst(hal_tim_handle_t *htim);

/**
  * @brief  Helper function to get the DMA burst base address register for a given channel.
  * @param  channel  Channel. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  *                  @arg @ref HAL_TIM_CHANNEL_5
  *                  @arg @ref HAL_TIM_CHANNEL_6
  *                  @arg @ref HAL_TIM_CHANNEL_7
  *                  @arg @ref HAL_TIM_CHANNEL_1N
  *                  @arg @ref HAL_TIM_CHANNEL_2N
  *                  @arg @ref HAL_TIM_CHANNEL_3N
  *                  @arg @ref HAL_TIM_CHANNEL_4N
  * @retval hal_tim_dmaburst_base_addr_reg_t  DMA burst base address register
  *         corresponding to the channel.
  */
__STATIC_INLINE hal_tim_dmaburst_base_addr_reg_t
hal_tim_channel_to_dmaburst_base_address(hal_tim_channel_t channel)
{
  const hal_tim_dmaburst_base_addr_reg_t ch_to_dmaburst_base_addr[] =
  {
    HAL_TIM_DMABURST_BASE_ADDR_CCR1,  /* HAL_TIM_CHANNEL_1  */
    HAL_TIM_DMABURST_BASE_ADDR_CCR2,  /* HAL_TIM_CHANNEL_2  */
    HAL_TIM_DMABURST_BASE_ADDR_CCR3,  /* HAL_TIM_CHANNEL_3  */
    HAL_TIM_DMABURST_BASE_ADDR_CCR4,  /* HAL_TIM_CHANNEL_4  */
    HAL_TIM_DMABURST_BASE_ADDR_CCR5,  /* HAL_TIM_CHANNEL_5  */
    HAL_TIM_DMABURST_BASE_ADDR_CCR6,  /* HAL_TIM_CHANNEL_6  */
    HAL_TIM_DMABURST_BASE_ADDR_CCR7,  /* HAL_TIM_CHANNEL_7  */
    HAL_TIM_DMABURST_BASE_ADDR_CCR1,  /* HAL_TIM_CHANNEL_1N */
    HAL_TIM_DMABURST_BASE_ADDR_CCR2,  /* HAL_TIM_CHANNEL_2N */
    HAL_TIM_DMABURST_BASE_ADDR_CCR3,  /* HAL_TIM_CHANNEL_3N */
    HAL_TIM_DMABURST_BASE_ADDR_CCR4,  /* HAL_TIM_CHANNEL_4N */
  };

