MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
  return ch_to_dmaburst_base_addr[channel];
}

/**
  *  @}
  */
#endif /* USE_HAL_TIM_DMA */

/** @defgroup TIM_Exported_Functions_Group12 Timer Break functions
  * @{
  *            Functions in this group configure and control the "break"
  *            feature that is present on certain timers that feature
  *            complementary outputs. \n
  *
  *            The Break utility acts on the output stage of timer channels
  *            configured in output mode. \n
  *            As soon as an active edge is detected on the break input,
  *            the outputs of timer channels configured in output mode are
  *            either turned off or forced to a predefined safe state.
  *
  *            Use the configuration API to:
  *             - for a break input (BKIN or BKIN2)
  *               - set the polarity
  *               - set the filter
  *               - set the alternate function
  *             - for a break input source
  *               - set the polarity
  *             - set the off state selection in idle and in run mode
  *
  *            Use the control API to:
  *             - enable/disable a break input (BKIN or BKIN2)
  *             - rearm a break input (BKIN or BKIN2) when it is configured
  *               in bi-directional mode
  *             - enable/disable a break input source
  *             - enable/disable the main output \n
  *               Control all outputs
  *             - enable/disable the automatic output \n
  *               Specify whether the main output can only be enabled by software
  *               or if it can be automatically re-enabled by hardware at next
  *               update event following the break condition disappearance
  *
  *
  */
hal_status_t HAL_TIM_BREAK_SetConfigInput(hal_tim_handle_t *htim,
                                          hal_tim_break_input_id_t brkin,
                                          const hal_tim_break_input_config_t *p_config);
void HAL_TIM_BREAK_GetConfigInput(const hal_tim_handle_t *htim,
                                  hal_tim_break_input_id_t brkin,
                                  hal_tim_break_input_config_t *p_config);

hal_status_t HAL_TIM_BREAK_SetInputPolarity(hal_tim_handle_t *htim,
                                            hal_tim_break_input_id_t brkin,
                                            hal_tim_break_input_polarity_t polarity);
hal_tim_break_input_polarity_t HAL_TIM_BREAK_GetInputPolarity(const hal_tim_handle_t *htim,
                                                              hal_tim_break_input_id_t brkin);

hal_status_t HAL_TIM_BREAK_SetInputFilter(hal_tim_handle_t *htim,
                                          hal_tim_break_input_id_t brkin,
                                          hal_tim_filter_t filter);
hal_tim_filter_t HAL_TIM_BREAK_GetInputFilter(const hal_tim_handle_t *htim,
                                              hal_tim_break_input_id_t brkin);

hal_status_t HAL_TIM_BREAK_SetInputMode(hal_tim_handle_t *htim,
                                        hal_tim_break_input_id_t brkin,
                                        hal_tim_break_input_mode_t mode);
hal_tim_break_input_mode_t HAL_TIM_BREAK_GetInputMode(const hal_tim_handle_t *htim,
                                                      hal_tim_break_input_id_t brkin);

hal_status_t HAL_TIM_BREAK_EnableInput(hal_tim_handle_t *htim,
                                       hal_tim_break_input_id_t brkin);
hal_status_t HAL_TIM_BREAK_DisableInput(hal_tim_handle_t *htim,
                                        hal_tim_break_input_id_t brkin);
hal_tim_break_input_status_t HAL_TIM_BREAK_IsEnabledInput(const hal_tim_handle_t *htim,
                                                          hal_tim_break_input_id_t brkin);

hal_status_t HAL_TIM_BREAK_RearmInput(hal_tim_handle_t *htim,
                                      hal_tim_break_input_id_t brkin);

hal_status_t HAL_TIM_BREAK_SetInputSourcePolarity(hal_tim_handle_t *htim,
                                                  hal_tim_break_input_id_t brkin,
                                                  uint32_t brkinsrc,
                                                  hal_tim_break_input_src_polarity_t polarity);
hal_tim_break_input_src_polarity_t HAL_TIM_BREAK_GetInputSourcePolarity(const hal_tim_handle_t *htim,
                                                                        hal_tim_break_input_id_t brkin,
                                                                        uint32_t brkinsrc);

hal_status_t HAL_TIM_BREAK_EnableInputSource(hal_tim_handle_t *htim,
                                             hal_tim_break_input_id_t brkin,
                                             uint32_t brkinsrc);
hal_status_t HAL_TIM_BREAK_DisableInputSource(hal_tim_handle_t *htim,
                                              hal_tim_break_input_id_t brkin,
                                              uint32_t brkinsrc);
hal_tim_break_input_src_status_t HAL_TIM_BREAK_IsEnabledInputSource(const hal_tim_handle_t *htim,
                                                                    hal_tim_break_input_id_t brkin,
                                                                    uint32_t brkinsrc);

hal_status_t HAL_TIM_BREAK_EnableMainOutput(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_BREAK_DisableMainOutput(hal_tim_handle_t *htim);
hal_tim_break_main_output_status_t HAL_TIM_BREAK_IsEnabledMainOutput(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_BREAK_EnableAutomaticOutput(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_BREAK_DisableAutomaticOutput(hal_tim_handle_t *htim);
hal_tim_break_automatic_output_status_t HAL_TIM_BREAK_IsEnabledAutomaticOutput(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_BREAK_SetBreakDelay(hal_tim_handle_t *htim,
                                         hal_tim_break_delay_t break_delay,
                                         uint32_t delay);
uint32_t HAL_TIM_BREAK_GetBreakDelay(const hal_tim_handle_t *htim,
                                     hal_tim_break_delay_t break_delay);

