MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.h
hal_status_t HAL_TIM_BREAK_SetOutputOffStates(hal_tim_handle_t *htim,
                                              const hal_tim_off_states_config_t *p_config);
void HAL_TIM_BREAK_GetOutputOffStates(const hal_tim_handle_t *htim,
                                      hal_tim_off_states_config_t *p_config);

hal_tim_output_disable_status_t HAL_TIM_BREAK_GetOutputDisableStatus(const hal_tim_handle_t *htim);

/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group13 Timer Deadtime functions
  * @{
  *            Functions in this group configure and control the "deadtime"
  *            feature.
  *
  *            Dead-time manages the switching-off and the switching-on instants
  *            of the outputs of two complementary signals.
  *
  *            Configuration:
  *            - set the deadtime for the rising edge
  *            - set the deadtime for the falling edge
  *
  *            Control:
  *            - When enabled, the transfer from DTG(F) preload to active value is
  *              triggered  by the timer's Update event.
  *
  *
  */
hal_status_t HAL_TIM_SetDeadtime(hal_tim_handle_t *htim,
                                 uint32_t rising_edge_deadtime,
                                 uint32_t falling_edge_deadtime);
void HAL_TIM_GetDeadtime(const hal_tim_handle_t *htim,
                         uint32_t *p_rising_edge_deadtime,
                         uint32_t *p_falling_edge_deadtime);

hal_status_t HAL_TIM_EnableDeadtimePreload(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableDeadtimePreload(hal_tim_handle_t *htim);
hal_tim_deadtime_preload_status_t HAL_TIM_IsEnabledDeadtimePreload(const hal_tim_handle_t *htim);

hal_status_t HAL_TIM_EnableAsymmetricalDeadtime(hal_tim_handle_t *htim);
hal_status_t HAL_TIM_DisableAsymmetricalDeadtime(hal_tim_handle_t *htim);
hal_tim_asymmetrical_deadtime_status_t HAL_TIM_IsEnabledAsymmetricalDeadtime(const hal_tim_handle_t *htim);
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group14 Timer Protection
  * @{
  *            This group contains only two functions that are the setter and
  *            getter of the lock level.
  *
  *            The lock feature is a write protection that freezes the
  *            configuration of safety critical parameters (e.g. break inputs
  *            and deadtime configuration).
  *
  */
hal_status_t HAL_TIM_SetLockLevel(hal_tim_handle_t *htim,
                                  hal_tim_lock_level_t lock_level);
hal_tim_lock_level_t HAL_TIM_GetLockLevel(const hal_tim_handle_t *htim);
/**
  *  @}
  */

/** @defgroup TIM_Exported_Functions_Group15 Timer Commutation control
  * @{
  *            This group contains functions required to manage the commutation
  *            feature. \n
  *            The commutation feature is used in combination with the preload
  *            mechanism to change the timer channel configuration (e.g. output
  *            mode, channel enabled/disabled) \n in perfect synchronization with
  *            timer external events generated by software or through a trigger
  *            input (internal (ITRx) or external (ETR, TI1, or TI2)). \n
  *            \n
  *            When the commutation feature is enabled, capture/compare control
  *            bits (CCxE, CCxNE and OCxM) are preloaded and \n the commutation
  *            event trigger is set as per application's choice (software and/or
  *            trigger input).
  *
  */
hal_status_t HAL_TIM_EnableCommutation(hal_tim_handle_t *htim,
                                       hal_tim_commutation_src_t commutation_source);
hal_status_t HAL_TIM_DisableCommutation(hal_tim_handle_t *htim);
hal_tim_commutation_status_t HAL_TIM_IsEnabledCommutation(const hal_tim_handle_t *htim);

hal_tim_commutation_src_t HAL_TIM_GetCommutationSource(const hal_tim_handle_t *htim);
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group16 Timer SW Event Generation
  * @{
  *            This group contains only one function that is used to control,
  *            by software, the generation of a timer's event.
  *
  */
hal_status_t HAL_TIM_GenerateEvent(hal_tim_handle_t *htim,
                                   hal_tim_sw_event_id_t sw_event_id);
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group17 Timer IRQ Handler and Callbacks functions
  * @{
  */

/* Interrupt Handler functions   **************************************************************************************/
void HAL_TIM_IRQHandler(hal_tim_handle_t *htim);
void HAL_TIM_UPD_IRQHandler(hal_tim_handle_t *htim);
void HAL_TIM_CC_IRQHandler(hal_tim_handle_t *htim);
void HAL_TIM_BRK_TERR_IERR_IRQHandler(hal_tim_handle_t *htim);
void HAL_TIM_TRGI_COM_DIR_IDX_IRQHandler(hal_tim_handle_t *htim);

/* Declaration for the weak callbacks *********************************************************************************/
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
void HAL_TIM_ErrorCallback(hal_tim_handle_t *htim);
void HAL_TIM_StopCallback(hal_tim_handle_t *htim);
void HAL_TIM_ChannelStopCallback(hal_tim_handle_t *htim,
                                 hal_tim_channel_t channel);
#endif /* USE_HAL_TIM_DMA */

void HAL_TIM_UpdateCallback(hal_tim_handle_t *htim);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
void HAL_TIM_UpdateHalfCpltCallback(hal_tim_handle_t *htim);
#endif /* USE_HAL_TIM_DMA */

void HAL_TIM_TriggerCallback(hal_tim_handle_t *htim);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
void HAL_TIM_TriggerHalfCpltCallback(hal_tim_handle_t *htim);
#endif /* USE_HAL_TIM_DMA */

void HAL_TIM_InputCaptureCallback(hal_tim_handle_t *htim,
                                  hal_tim_channel_t channel);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
void HAL_TIM_InputCaptureHalfCpltCallback(hal_tim_handle_t *htim,
                                          hal_tim_channel_t channel);
#endif /* USE_HAL_TIM_DMA */

void HAL_TIM_CompareMatchCallback(hal_tim_handle_t *htim,
                                  hal_tim_channel_t channel);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
void HAL_TIM_CompareMatchHalfCpltCallback(hal_tim_handle_t *htim,
                                          hal_tim_channel_t channel);
#endif /* USE_HAL_TIM_DMA */

void HAL_TIM_CommutationCallback(hal_tim_handle_t *htim);

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
void HAL_TIM_CommutationHalfCpltCallback(hal_tim_handle_t *htim);
#endif /* USE_HAL_TIM_DMA */

void HAL_TIM_BreakCallback(hal_tim_handle_t *htim);
void HAL_TIM_Break2Callback(hal_tim_handle_t *htim);
void HAL_TIM_SystemBreakCallback(hal_tim_handle_t *htim);
void HAL_TIM_SoftwareBreakCallback(hal_tim_handle_t *htim,
                                   hal_tim_break_input_id_t bkin);

void HAL_TIM_EncoderIndexCallback(hal_tim_handle_t *htim);
void HAL_TIM_DirectionChangeCallback(hal_tim_handle_t *htim);
void HAL_TIM_IndexErrorCallback(hal_tim_handle_t *htim);
void HAL_TIM_TransitionErrorCallback(hal_tim_handle_t *htim);

/* Interfaces for registering callbacks *******************************************************************************/
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_RegisterErrorCallback(hal_tim_handle_t *htim,
                                           hal_tim_cb_t fct);
hal_status_t HAL_TIM_RegisterStopCallback(hal_tim_handle_t *htim,
                                          hal_tim_cb_t fct);
hal_status_t HAL_TIM_RegisterChannelStopCallback(hal_tim_handle_t *htim,
                                                 hal_tim_channel_cb_t fct);
#endif /* USE_HAL_TIM_DMA */

hal_status_t HAL_TIM_RegisterUpdateCallback(hal_tim_handle_t *htim,
                                            hal_tim_cb_t fct);
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_RegisterUpdateHalfCpltCallback(hal_tim_handle_t *htim,
                                                    hal_tim_cb_t fct);
#endif /* USE_HAL_TIM_DMA */
hal_status_t HAL_TIM_RegisterTriggerCallback(hal_tim_handle_t *htim,
                                             hal_tim_cb_t fct);
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_RegisterTriggerHalfCpltCallback(hal_tim_handle_t *htim,
                                                     hal_tim_cb_t fct);
#endif /* USE_HAL_TIM_DMA */
hal_status_t HAL_TIM_RegisterInputCaptureCallback(hal_tim_handle_t *htim,
                                                  hal_tim_channel_cb_t fct);
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_RegisterInputCaptureHalfCpltCallback(hal_tim_handle_t *htim,
                                                          hal_tim_channel_cb_t fct);
#endif /* USE_HAL_TIM_DMA */
hal_status_t HAL_TIM_RegisterCompareMatchCallback(hal_tim_handle_t *htim,
                                                  hal_tim_channel_cb_t fct);
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_RegisterCompareMatchHalfCpltCallback(hal_tim_handle_t *htim,
                                                          hal_tim_channel_cb_t fct);
#endif /* USE_HAL_TIM_DMA */
hal_status_t HAL_TIM_RegisterCommutationCallback(hal_tim_handle_t *htim,
                                                 hal_tim_cb_t fct);
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
hal_status_t HAL_TIM_RegisterCommutationHalfCpltCallback(hal_tim_handle_t *htim,
                                                         hal_tim_cb_t fct);
#endif /* USE_HAL_TIM_DMA */
hal_status_t HAL_TIM_RegisterBreakCallback(hal_tim_handle_t *htim,
                                           hal_tim_cb_t fct);
hal_status_t HAL_TIM_RegisterBreak2Callback(hal_tim_handle_t *htim,
                                            hal_tim_cb_t fct);
hal_status_t HAL_TIM_RegisterSystemBreakCallback(hal_tim_handle_t *htim,
                                                 hal_tim_cb_t fct);
hal_status_t HAL_TIM_RegisterSoftwareBreakCallback(hal_tim_handle_t *htim,
                                                   hal_tim_break_cb_t fct);

hal_status_t HAL_TIM_RegisterEncoderIndexCallback(hal_tim_handle_t *htim,
                                                  hal_tim_cb_t fct);
hal_status_t HAL_TIM_RegisterDirectionChangeCallback(hal_tim_handle_t *htim,
                                                     hal_tim_cb_t fct);
hal_status_t HAL_TIM_RegisterIndexErrorCallback(hal_tim_handle_t *htim,
                                                hal_tim_cb_t fct);
hal_status_t HAL_TIM_RegisterTransitionErrorCallback(hal_tim_handle_t *htim,
                                                     hal_tim_cb_t fct);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
/**
  *  @}
  */


/** @defgroup TIM_Exported_Functions_Group18 Timer Setter and Getter of the user data
  * @{
  */
#if defined (USE_HAL_TIM_USER_DATA) && (USE_HAL_TIM_USER_DATA == 1)
void HAL_TIM_SetUserData(hal_tim_handle_t *htim, const void *p_user_data);
const void *HAL_TIM_GetUserData(const hal_tim_handle_t *htim);
#endif /* USE_HAL_TIM_USER_DATA */
/**
  *  @}
  */

/**
  *  @}
  */

/**
  *  @}
  */

#endif /* TIM1 || TIM2 || TIM3 || TIM4 || TIM5 || TIM6 || TIM7 || TIM8 || TIM12 || TIM15 || TIM16 || TIM17 */
/**
  *  @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_TIM_H */
